<?php

use Illuminate\Database\Seeder;
use App\Answer;

class answerSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $answer1 =[
            'اقوم برميها على النادل واقلب الطاولة.',
            ' اطلب استدعاء المدير واقوم بتوبيخه.',
            ' اطلب بأدب من النادل ان يقوم بتبديلها.',
            'اتناولها, فهي بالتأكيد ليست إلى هذا الحدّ من السوء.',

            'اجلس جانبا وأغضب, ولا اتحدث مع أي شخص.',
            '  اغضب وأعدّ الدقائق حتى اخرج من الحفلة.',
            ' اقضي الوقت بتناول الطعام والشراب.',
            'احاول التعرف على اشخاص لطيفين لقضاء الوقت.',

            'نعم, جدًا.',
            '  نعم, يغضبني الى حد كبير.',
            ' كلا، لا يغضبني كثيرًا.',
            '  كلا، لا يغضبني إطلاقا.  ',


            'اضربه بقوة واشتم اباه وامه.',
            '     اشتم امه فقط.',
            '    لا اشتمه, ففي نهاية المطاف حوادث السير هي شيء يحدث عادة.',
            '  اسأله عن صحته واتبادل معه التفاصيل بلطف.  ',

            'نعم, جدًا.',
            '     نعم, قليلًا.',
            '     كلا، على ما أعتقد.',
            '  كلا، لن أغضب، إطلاقا. ',
         
            'اقوم برميها على النادل واقلب الطاولة.',
            ' اطلب استدعاء المدير واقوم بتوبيخه.',
            ' اطلب بأدب من النادل ان يقوم بتبديلها.',
            'اتناولها, فهي بالتأكيد ليست إلى هذا الحدّ من السوء.',

            'اجلس جانبا وأغضب, ولا اتحدث مع أي شخص.',
            '  اغضب وأعدّ الدقائق حتى اخرج من الحفلة.',
            ' اقضي الوقت بتناول الطعام والشراب.',
            'احاول التعرف على اشخاص لطيفين لقضاء الوقت.',

            'نعم, جدًا.',
            '  نعم, يغضبني الى حد كبير.',
            ' كلا، لا يغضبني كثيرًا.',
            '  كلا، لا يغضبني إطلاقا.  ',


            'اضربه بقوة واشتم اباه وامه.',
            '     اشتم امه فقط.',
            '    لا اشتمه, ففي نهاية المطاف حوادث السير هي شيء يحدث عادة.',
            '  اسأله عن صحته واتبادل معه التفاصيل بلطف.  ',

            'نعم, جدًا.',
            '     نعم, قليلًا.',
            '     كلا، على ما أعتقد.',
            '  كلا، لن أغضب، إطلاقا. ',

                       
                        'اقوم برميها على النادل واقلب الطاولة.',
                        ' اطلب استدعاء المدير واقوم بتوبيخه.',
                        ' اطلب بأدب من النادل ان يقوم بتبديلها.',
                        'اتناولها, فهي بالتأكيد ليست إلى هذا الحدّ من السوء.',
            
                        'اجلس جانبا وأغضب, ولا اتحدث مع أي شخص.',
                        '  اغضب وأعدّ الدقائق حتى اخرج من الحفلة.',
                        ' اقضي الوقت بتناول الطعام والشراب.',
                        'احاول التعرف على اشخاص لطيفين لقضاء الوقت.',
            
                        'نعم, جدًا.',
                        '  نعم, يغضبني الى حد كبير.',
                        ' كلا، لا يغضبني كثيرًا.',
                        '  كلا، لا يغضبني إطلاقا.  ',
            
            
                        'اضربه بقوة واشتم اباه وامه.',
                        '     اشتم امه فقط.',
                        '    لا اشتمه, ففي نهاية المطاف حوادث السير هي شيء يحدث عادة.',
                        '  اسأله عن صحته واتبادل معه التفاصيل بلطف.  ',
            
                        'نعم, جدًا.',
                        '     نعم, قليلًا.',
                        '     كلا، على ما أعتقد.',
                        '  كلا، لن أغضب، إطلاقا. ',
                      

                        'اقوم برميها على النادل واقلب الطاولة.',
                        ' اطلب استدعاء المدير واقوم بتوبيخه.',
                        ' اطلب بأدب من النادل ان يقوم بتبديلها.',
                        'اتناولها, فهي بالتأكيد ليست إلى هذا الحدّ من السوء.',
            
                        'اجلس جانبا وأغضب, ولا اتحدث مع أي شخص.',
                        '  اغضب وأعدّ الدقائق حتى اخرج من الحفلة.',
                        ' اقضي الوقت بتناول الطعام والشراب.',
                        'احاول التعرف على اشخاص لطيفين لقضاء الوقت.',
            
                        'نعم, جدًا.',
                        '  نعم, يغضبني الى حد كبير.',
                        ' كلا، لا يغضبني كثيرًا.',
                        '  كلا، لا يغضبني إطلاقا.  ',
            
            
                        'اضربه بقوة واشتم اباه وامه.',
                        '     اشتم امه فقط.',
                        '    لا اشتمه, ففي نهاية المطاف حوادث السير هي شيء يحدث عادة.',
                        '  اسأله عن صحته واتبادل معه التفاصيل بلطف.  ',
            
                        'نعم, جدًا.',
                        '     نعم, قليلًا.',
                        '     كلا، على ما أعتقد.',
                        '  كلا، لن أغضب، إطلاقا. ',


                        
                        'اقوم برميها على النادل واقلب الطاولة.',
                        ' اطلب استدعاء المدير واقوم بتوبيخه.',
                        ' اطلب بأدب من النادل ان يقوم بتبديلها.',
                        'اتناولها, فهي بالتأكيد ليست إلى هذا الحدّ من السوء.',
            
                        'اجلس جانبا وأغضب, ولا اتحدث مع أي شخص.',
                        '  اغضب وأعدّ الدقائق حتى اخرج من الحفلة.',
                        ' اقضي الوقت بتناول الطعام والشراب.',
                        'احاول التعرف على اشخاص لطيفين لقضاء الوقت.',
            
                        'نعم, جدًا.',
                        '  نعم, يغضبني الى حد كبير.',
                        ' كلا، لا يغضبني كثيرًا.',
                        '  كلا، لا يغضبني إطلاقا.  ',
            
            
                        'اضربه بقوة واشتم اباه وامه.',
                        '     اشتم امه فقط.',
                        '    لا اشتمه, ففي نهاية المطاف حوادث السير هي شيء يحدث عادة.',
                        '  اسأله عن صحته واتبادل معه التفاصيل بلطف.  ',
            
                        'نعم, جدًا.',
                        '     نعم, قليلًا.',
                        '     كلا، على ما أعتقد.',
                        '  كلا، لن أغضب، إطلاقا. ',


                       
                         'اقوم برميها على النادل واقلب الطاولة.',
                         ' اطلب استدعاء المدير واقوم بتوبيخه.',
                         ' اطلب بأدب من النادل ان يقوم بتبديلها.',
                         'اتناولها, فهي بالتأكيد ليست إلى هذا الحدّ من السوء.',
             
                         'اجلس جانبا وأغضب, ولا اتحدث مع أي شخص.',
                         '  اغضب وأعدّ الدقائق حتى اخرج من الحفلة.',
                         ' اقضي الوقت بتناول الطعام والشراب.',
                         'احاول التعرف على اشخاص لطيفين لقضاء الوقت.',
             
                         'نعم, جدًا.',
                         '  نعم, يغضبني الى حد كبير.',
                         ' كلا، لا يغضبني كثيرًا.',
                         '  كلا، لا يغضبني إطلاقا.  ',
             
             
                         'اضربه بقوة واشتم اباه وامه.',
                         '     اشتم امه فقط.',
                         '    لا اشتمه, ففي نهاية المطاف حوادث السير هي شيء يحدث عادة.',
                         '  اسأله عن صحته واتبادل معه التفاصيل بلطف.  ',
             
                         'نعم, جدًا.',
                         '     نعم, قليلًا.',
                         '     كلا، على ما أعتقد.',
                         '  كلا، لن أغضب، إطلاقا. ',
         
        ];
        $value =[
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,


            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,


            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,

            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,

            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,

            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
         
        ];

        $question_id =[
            1,1,1,1,
            2,2,2,2,
            3,3,3,3,
            4,4,4,4,
            5,5,5,5,


            6,6,6,6,
            7,7,7,7,
            8,8,8,8,
            9,9,9,9,
            10,10,10,10,

           11,11,11,11,
            12,12,12,12,
            13,13,13,13,
            14,14,14,14,
            15,15,15,15,

            16,16,16,16,
            17,17,17,17,
            18,18,18,18,
            19,19,19,19,
            20,20,20,20,

            21,21,21,21,
            22,22,22,22,
            23,23,23,23,
            24,24,24,24,
            25,25,25,25,

            26,26,26,26,
            27,27,27,27,
            28,28,28,28,
            29,29,29,29,
            30,30,30,30,
          
        ];

       
        for( $i=0;$i<count($value); $i++){
            $answer =new Answer();
            $answer ->answer =$answer1[$i];
            $answer ->value =$value[$i];
           $answer->question_id = $question_id[$i];
           
            $answer->save();
        }
    }
}
