<?php

use Illuminate\Database\Seeder;
use App\Answer;

class answerSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $answer1 =[
            'اقوم برميها على النادل واقلب الطاولة.',
            ' اطلب استدعاء المدير واقوم بتوبيخه.',
            ' اطلب بأدب من النادل ان يقوم بتبديلها.',
            'اتناولها, فهي بالتأكيد ليست إلى هذا الحدّ من السوء.',

            'اجلس جانبا وأغضب, ولا اتحدث مع أي شخص.',
            '  اغضب وأعدّ الدقائق حتى اخرج من الحفلة.',
            ' اقضي الوقت بتناول الطعام والشراب.',
            'احاول التعرف على اشخاص لطيفين لقضاء الوقت.',

            'نعم, جدًا.',
            '  نعم, يغضبني الى حد كبير.',
            ' كلا، لا يغضبني كثيرًا.',
            '  كلا، لا يغضبني إطلاقا.  ',


            'اضربه بقوة واشتم اباه وامه.',
            '     اشتم امه فقط.',
            '    لا اشتمه, ففي نهاية المطاف حوادث السير هي شيء يحدث عادة.',
            '  اسأله عن صحته واتبادل معه التفاصيل بلطف.  ',

            'نعم, جدًا.',
            '     نعم, قليلًا.',
            '     كلا، على ما أعتقد.',
            '  كلا، لن أغضب، إطلاقا. ',

             

            'أتناول الطعام عندما اشعر بالجوع فقط.',
            ' أتناول وجبات صغيرة كل ثلاث ساعات.',
            ' أتناول ثلاث وجبات في اليوم.',
            'أتناول الطعام كلما سنحت لي الفرصة.',

            'ليس لدي وزن زائد',
            ' 2 – 4 كيلوغرامات فقط.',
            ' لدي مشكلة وزن زائد، من 5 – 10 كيلوغرامات.',
            'الوضع ليس جيدا. لدي زيادة 11 – 15 كيلوغراما.',

            'ولا مرة على الإطلاق',
            ' 2 – 3 مرات.   ',
            ' كل عام، قبل حلول فصل الصيف.',
            'مرات لا تعد ولا تحصى. من يتذكر؟',

            'لا يقلقني على الإطلاق.',
            ' تتغير الأهمية حسب الوضع.   ',
            ' هو مركز اهتمامي، من بين أهم ثلاثة أمور لديّ.',
            'هو الشيء الأهم في حياتي، أكثر شيء يشغلني.',

            'نوع من العادة، دون الكثير من التفكير.',
            ' الجوع مرتبط بالوقت وبالفرصة من العمل.   ',
            ' الجوع عاطفي – عملية تعويض، هذا يريحني.',
            'جوع صرف، الجسم يصرخ: الطعام!',




            'لا اشعر بالحزن.',
            ' انا حزين   ',
            ' اشعر بالحزن طوال الوقت ولا يمكنني التخلص منه.',
            'اشعر بالحزن الشديد او التعاسة حتى انه لا يمكنني تحمل ذلك.',

            'لا اشعر بالإحباط, خاصة حيال المستقبل.',
            ' اشعر بالإحباط من المستقبل.    ',
            ' اشعر انه ليس لدي ما يمكن توقعه.',
            'اشعر باليأس حيال المستقبل وان الأمور لا يمكن ان تتحسن.',


            'لا اشعر بالفشل.',
            ' اشعر بأنني فشلت أكثر من الشخص العادي.    ',
            ' عندما القي نظرة إلى الوراء على حياتي, فجُلّ ما اراه هو العديد من الإخفاقات.',
            'أشعر بأنني فشلت فشلا ذريعا كانسان.',

            'انا استمتع بالاشياء الان مثلما استمعت بها في الماضي.',
            'انا لا استمتع بالاشياء الان مثلما استمعت بها في الماضي.    ',
            ' لا اشعر بالاستمتاع الحقيقي في أي شيء.',
            'لا اشعر بالرضا من أي شيء، أو بأن كل شيء قد أصبح مملا.',

            'لا اشعر بالذنب بشكل خاص.',
            'اشعر بالذنب احيانًا.    ',
            ' اشعر بالذنب في معظم الوقت.',
            'اشعر بالذنب طوال الوقت.',


            'عبارة عن حرب عالمية!',
            'تسمع الصراخ من أجل إقناع الطفل بتناول كامل صحنه',
            '  ان الأمر يعتمد على مزاج طفلي',
            'طفلي حبيبي لا يغلبني بتاتاً',
             
            'يغلق فمه بإحكام إن حاولت إطعامه',
            'يبكي قليلا من ثم يبصق الطعام',
            '  يحاول إبعاد يدي عدة مرات حتى ياكل',
            'يتناول الطعام وهو مبتسم!',

            'يرفض تناول الطعام كلياً ويأخذ بالبكاء',
            'يرفض تناول هذا الطعام الجديد',
            '  تناول ضقمة منه ومن ثم لجأ إلى النوع الذي يحبه',
            'تناوله لكن بصعوبة بعد الاقناع',

            'لا أبداً، فهذا الأمر للبالغين فقط ',
            ' لم أفكر في هذا الموضوع، لكن قد يرافقني المرة القادمة',
            '  رافقني وساعدني عدة مرات',
            'صغيري يهتم دائما ويشاركني في تحضير الطعام',

            'يرفض قطعياً تناوله ويغلق فمه ويدير وجهه ',
            ' يتناول عدة قضمات ويبصقها',
            '  يقوم بتناول ضقمات صغيرة',
            'هو يحب الخضار كثيراً ',


            '20% من الفاتورة – فلتدلل نفسها ',
            ' ليس أقل من 12٪ من مبلغ الفاتورة.',
            '  حوالي 10٪, حسب مستوى الخدمة.',
            'بضعة دولارات, وإن كان من الممكن، أحاول التهرب من دفعه. ',


            'اعطيه على الفور, واقول له ان لا يقلق بشأن تسديد الدين. ',
            ' اعطيه, واكون سعيدا لأنني استطعت مساعدته.',
            '  اعطيه اقل مما اراد, واطلب منه ارجاعه في اقرب وقت ممكن.',
            'لا اعطيه. فأنا أعاني من ضائقة اقتصادية, وأنا لست بَنكاً! ',

            'بالتأكيد, انا ادفع دائما. ',
            ' نعم, انا من يدفع في غالبية الحالات.',
            ' فقط في المواعيد الغرامية الاولية.',
            'عذرا؟ فلتدفع هي عن نفسها. ',

            'ادعو الجميع على الفور لتناول الشوكولاطة.',
            'ادعو بعض الاصدقاء, واعطي قطعة واحدة لكل واحد.',
            ' ادعو اثنين من الاصدقاء, وقبل ذلك احافظ على نصف الشوكولاطة جانبا.',
            'احتفظ بها لنفسي, أما بالنسبة للاصدقاء فهنالك الشوكولاطة الرخيصة.',

            'اقوم بدعوتهم دائما, انه لمن دواعي سروري.',
            'غالبا ما اقوم بدعوتهم.',
            ' نادرا ما ادعوهم, وآمل ان يدعونني بالمقابل.',
            'ابدا, لماذا, ماذا, الا يمتلكون النقود؟',

            'حتى اثناء وجودهم عندي, اقوم بتنظيف كل شيء متسخ.',
            'بعد ذهابهم مباشرة.',
            ' في اليوم التالي.',
            'بعد اسبوع.',

            'لا شيء, ربما بقايا الصابون.',
            'القليل من قطع الطعام الصغيرة.',
            ' بقايا الوجبة الاخيرة.',
            'اللحم, الحليب والحلويات منذ العام الماضي.',

            'حاشا وكلا.',
            'فقط الاطعمة التي لا توسخ بشكل خاص.',
            ' نعم, من حين إلى آخر.',
            'دائما, اتناول جميع انواع الاطعمة.',


            'هذا الاسبوع.',
            'الاسبوع الماضي.',
            ' الشهر الماضي.',
            'لا أتذكر!',


            'كلا, ابدًا.',
            'نادرًا',
            '  هذا يتعلق بمدى اتساخها.',
            'نعم, دائما. ارتديها عدة مرات متتالية.',


           


        ];
        $value =[
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,


            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,


            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,

            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,

            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,

            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,
            1,2,3,4,

        ];

        $question_id =[
            1,1,1,1,
            2,2,2,2,
            3,3,3,3,
            4,4,4,4,
            5,5,5,5,


            6,6,6,6,
            7,7,7,7,
            8,8,8,8,
            9,9,9,9,
            10,10,10,10,

            11,11,11,11,
            12,12,12,12,
            13,13,13,13,
            14,14,14,14,
            15,15,15,15,

            16,16,16,16,
            17,17,17,17,
            18,18,18,18,
            19,19,19,19,
            20,20,20,20,

            21,21,21,21,
            22,22,22,22,
            23,23,23,23,
            24,24,24,24,
            25,25,25,25,

            26,26,26,26,
            27,27,27,27,
            28,28,28,28,
            29,29,29,29,
            30,30,30,30,

        ];


        for( $i=0;$i<count($value); $i++){
            $answer =new Answer();
            $answer ->answer =$answer1[$i];
            $answer ->value =$value[$i];
           $answer->question_id = $question_id[$i];

            $answer->save();
        }
    }
}
