<?php

use Illuminate\Database\Seeder;
use App\Disease;

class DiseaseDB extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        
        $titles =[
            // دي كده الرأس
            'تساقط الشعر عند الرجال'
            ,
            'الصداع'
            ,
            'الدوار عند الوقوف'
            ,
            'ألم الرقبة'
            ,
            'فقدان الشم والتذوق'
            ,
            'تورم الغدد في الرقبة'
            ,
            'ألم الفك, اللثة اة الأسنان'
            ,
            'الأرق'
            ,

            // دي كده العيون
            ' جفاف العين والفم'
            ,
            ' افرازات العين'
            ,
            ' ألم العين'
            ,
            //الأنف والاذن والحنرة
            'السعال والبرد'
            ,
            ' جفاف الفم والعطش الزائد '
            ,
            ' الم الاذن عند الكبار
'
            ,
            ' السعال المزمن'
            ,
            ' التهاب الحلق'
            ,
            ' فقدان السمع المفاجئ'
            ,
            ' صعوبة البلع'
            ,
            ' طنين الاذن'
            ,
            //الصدر والظهر
            ' الم الصدر'
            ,
            ' خفقان القلب'
            ,
            ' الم اسفل الظهر'
            ,
            ' ضيق التنفس عند الكبار'
            ,
            ' الصفير مع التنفس عند الكبار'
            ,
            // الذراعين واليدين
            ' الم المرفق'
            ,
            ' الم اليد'
            ,
            ' مشاكل الاظافر'
            ,
            ' العامل الروماتويدي الايجابي'
            ,
            ' الم الكتف'
            ,
            ' الم الرسغ'
            ,
            // البطن والحوض
            ' علاج ارتداد حمض المعدة'
            ,
            ' غازات الامعاء'
            ,
            ' الدم في البول عند الرجال'
            ,
            ' فحص سرطان القولون'
            ,
            ' الامساك عند الكبار'
            ,
            ' الاسهال'
            ,
            ' صعوبة التبول'
            ,
            ' ضعف العضلات'
            ,
            ' الم مفصل الحوض'
            ,
            ' فقد السيطرة على التبول عند الرجال'
            ,
            ' ورم او الم في كيس الخصيتين'
            ,
            ' كثرة التبول او التبول المؤلم عند الرجال'
            ,
            ' الم القضيب، قروحه، افرازاته او اورامه'
            ,
            ' نزيف المستقيم'
            ,
            ' الم المستقيم والحكة'
            ,
            ' الالم المتكرر في البطن'
            ,
            ' الم البطن الشديد حديث الظهور'
            ,
            ' مستضد البروستاتا'
            ,
            // القدمين والساقين
            ' الم القدم'
            ,
            ' النقرس'
            ,
            ' الم الركبة'
            ,
            ' تورم القدم الحاد'
            ,
            ' الالتهاب العظمي المفصلي للركبة'
            ,
            ' تورم الركبة المزمن'
            ,
            ' الم الكاحل'
            ,
          
        ];

        $descriptions =[
            // الراس
            '
            مرحبا بك في دليلنا عن تساقط الشعر لدى الرجال.

            يمكن ان يتوقع معظم الرجال بعض التساقط في الشعر او تغير شكل الشعر بينما يتقدمون في العمر. يكون تساقط الشعر تدريجيا عادة، لكن يمكن ان يحدث احيانا بصورة مفاجئة، سريعة او غير طبيعية. يمكن ان يكون هذا النوع من تساقط الشعر علامة على مرض مسبب او مشكلة طبية احيانا.
            
            ربما يؤدي تساقط الشعر الى نقص غزارة الشعر، يسبب الصلع في منطقة او اكثر في فروة الراس.
            
            قد خصص هذا الدليل لمساعدتك على معرفة سبب تساقط الشعر ولتوجيهك نحو الاتجاه الصحيح للتقييم والعلاج. من فضلك الاخذ في عين الاعتبار ان هذه المعلومات لا يمكن ان تحل محل التقييم الذي يكون وجها لوجه مع الطبيب الخاص بك.
            ',
            '
            الصداع

            يؤسفنا انك تعاني من الصداع.
            
            صمم هذا الدليل لتشخيص اسباب الصداع، للاشخاص الذين يعانون من صداع اما جديد او مختلف عن الصداع السابق. رغم ذلك، ربما يجد اي شخص يعاني من صداع مستمر بعض المعلومات المفيدة له في هذا الدليل ايضا.
            
            هناك العديد من الاسباب المحتملة لصداعك. عن طريق الاجابة على بعض الاسئلة، سوف تعرف عن الاسباب او الاسباب المحتملة التي تتعلق بحالتك.
            
            هذا الدليل هو اداة تعليمية، لا يحل محل استشارة طبيبك الخاص. لنبدا.
            ',
            '
            الدوار عند الوقوف

            مرحبا.

            يستخدم الناس مصطلح الدوار لوصف احاسيس مختلفة. هذا الدليل معد من اجل نوع واحد من الاحساس بالدوار. الشعور بالدوار عند الوقوف. الذي يتحسن عندما ترقد. سيتم توجيه سلسلة قصيرة من الاسئلة، التي ستقودك الى معلومات متعلقة باعراضك.

            قد يتفاوت الشعور بالدوار من الاحساس الغامض "بعدم صفاء الدماغ"، الى الاعراض القاسية بالشعور بالاغماء عند الوقوف.

            بشكل طبيعي عندما تقف ينخفض ضغط الدم لثوان قليلة، لكنه يرتفع بعد ذلك لضمان تدفق دم كاف الى الدماغ. حدوث الدوار عند التحرك من وضع الرقود الى وضع الجلوس او الوقوف، عادة يعني ان ضغط الدم لديك قد انخفض بشكل غير مناسب. يطلق الاطباء على هذا اسم انخفاض ضغط الدم الوضعي (postural hypotension).

            اذا كان هذا الوصف لا ينطبق على الدوار الذي تعاني منه، فالرجاء الدخول الى دليل: دوار ظهر حديثا.
            ',
            '
            الم الرقبة

            ناسف لانك تعاني من الام الرقبة.

            من فضلك خذ دقائق قليلة للاجابة عن بعض الاسئلة، سوف يقدم هذا الدليل بعض الاسباب الاكثر شيوعا، اضافة الى بعض المعلومات المفيدة. الرجاء الاخذ بعين الاعتبار ان هذا الدليل لا يقصد به ان يكون بديلا للتقييم وجها لوجه مع طبيبك.

            ربما يكون الم الرقبة عرضا لحالة خطيرة، تتطلب تقييما فوريا. والسؤال الاول مخصص للتعرف على هذه الحالات النادرة.
            ',
            '            
            فقدان الشم والتذوق

            مرحبا بك في هذا الدليل عن فقدان الشم، و/او التذوق. ناسف لانك تعاني من هذه المشكلة!

            وقد تم انشاء هذا الدليل من اجل الاشخاص الذين لاحظوا وجود مشكلة في الشم، او التذوق (او كليهما)، ويرغبون في معرفة المزيد عن هاتين المشكلتين.

            من فضلك خذ في الاعتبار ان هذه المعلومات، لا يمكن ان تغني عن التشخيص المباشر من قبل طبيبك. هذا الدليل مقصود به تقديم معلومات مفيدة اثناء انتظار التقييم، او الاضافة الى ما تعرفه فعلا بعد زيارة الطبيب.

            وفي هذا الدليل سوف توجه لك سلسلة من الاسئلة عن بعض الحالات الاكثر شيوعا التي ربما تفسر اعراضك. وسوف يغطي هذا الدليل الاسباب الاكثر شيوعا لمشكلات الشم والتذوق، ورغم ذلك لن يغطي كل الاسباب.

            لذلك اذا لم تنطبق عليك اي من الحالات الموجودة في هذا الدليل، ضع في اعتبارك انه لا يتم اكتشاف سبب احيانا. او ربما انت تعاني من سبب نادر لمشكلة الشم، او التذوق لم تتم تغطيته هنا.
            '
            ,
            '       
            تورم الغدد في الرقبة

            مرحبا بك في دليلنا حول تورم الغدد في الرقبة.

            يشير لفظ "تورم الغدد" عادة الى تضخم العقد الليمفاوية. مع ذلك، فان العقد الليمفاوية ليست في الحقيقة غددا. بل هي تجمعات صغيرة من خلايا الدم البيضاء، توجد في مناطق متعددة من الجسم.

            من الطرق التي يستجيب بها جهاز المناعة في الجسم للعدوى والالتهاب، هي زيادة عدد خلايا الدم البيضاء بشكل كبير في العقد الليمفاوية مما يجعلها تتضخم. وغالبا ما يحدث تضخم العقد الليمفاوية بسبب عدوى، او حالة حميدة اخرى. وبشكل اقل شيوعا تتضخم العقد الليمفاوية ارتباطا بالسرطان.

            اجزاء الجسم التي يحس فيها الناس والاطباء العقد الليمفاوية، تشمل: الرقبة، والابط، واعلى الفخذ.

            هذا الدليل هو فقط عن الغدد المتورمة في الرقبة. وبالاجابة على سلسلة قصيرة من الاسئلة، سوف تعرف عن الاسباب الاكثر شيوعا لتورم الغدد في الرقبة.

            ولا يقصد به ان يحل محل التقييم، والنصيحة بواسطة محترف الرعاية الصحية.
            ' 
            ,
            '
                        
            الم الفك، اللثة او الاسنان

            مرحبا بك في دليل الم الفك والاسنان. ناسف على كونك تعاني من الالم!

            هذا الدليل مخصص للاشخاص الذين يعانون من الم الفك، او اللثة، او الاسنان.

            هدف هذا الدليل هو تقديم معلومات اثناء انتظار تشخيص طبيب الاسنان، او مهني صحة اخر. او قد يكون مفيدا كمعلومات اضافية بعد رؤية مقدم الرعاية الصحية. من فضلك، ضع في اعتبارك ان هذا الدليل لا يشكل بديلا للتشخيص المباشر  من قبل طبيبك، او طبيب الاسنان الخاص بك. والتشخيصات التي تناقش هنا هي من بين التشخيصات الاكثر شيوعا التي يمكن ان تفسر اعراضك، لكن القائمة ليست مكتملة تماما، وقد تكون هناك احتمالات عديدة اخرى. اضافة الى ذلك، ربما توجد هناك اكثر من حالة واحدة في الوقت نفسه.

            بداية من المهم الحصول على الرعاية العاجلة، اذا كانت تبدو اعراضك بسبب حالة خطيرة، او تهديد فوري لصحتك. على سبيل المثال، قد  يكون الم الفك احيانا عرضا للذبحة القلبية، او نوبه قلبية.

            '
            ,
            '

            الارق

            مرحبا بك في دليل الارق!

            هذا الدليل لا يشكل بديلا عن الاستشارة الطبية المباشرة لدى طبيبك. ,وانما غرض هذا الدليل هو مساعدتك في الحصول على الفائدة الكبرى من التقييم الطبي بواسطة طبيبك.

            يمكن ان ينشا الارق المستمر، من اسباب متنوعة متضمنة بعض الحالات الطبية الخطيرة. اذا كنت تعاني من ارق مستمر لاكثر من اسابيع قليلة، او ارق يصاحبه اعراض جسمية خلال الليل، او ارق يتعارض مع يقظتك وادائك اثناء النهار، فيجب مراجعة الطبيب. واذا كان هذا هو وضعك، ولم تفعل ذلك فعلا فمن فضلك، قم اليوم بترتيب موعد للتشخيص الطبي.

            لا يتطلب الارق علاجا بالادوية غالبا، ما دمت قادرا على تشخيص وازالة المشكلة التي تتعارض مع النوم الطبيعي. وبدخولك الى دليلنا الطبي قبل التقييم، ربما تكون قادرا على التعرف على اعراضك بشكل اكثر وضوحا، او التعرف على مميزات الارق عندك لمعرفة سببه. هدفنا هو مساعدتك على المضي قدما وسريعا مع طبيبك ناحية الاختبارات، او الاجراءات التي يمكن ان تبين السبب بشكل صحيح. ولا يمكن لهذا الدليل ان يضع في الحسبان التاريخ المرضي السابق، الذي ربما يكون لديك بشكل كاف. ومع الفهم الكامل لتاريخك الصحي السابق، ربما يختار طبيبك الخاص مسارا مختلفا لتقييم اعراضك.
            '
            ,
            // العين
            '
            
            جفاف العين والفم

            مرحبا بك في الدليل الخاص بنا عن الجفاف المستمر وطويل الامد للعين و/او الفم، وهي حالة تسمى عادة "متلازمة جفافية - SICCA syndrome". والاسم ياتي من الكلمة اللاتينية "siccus" التي تعني "جاف".

            اعراض جفاف العين قد تظهر بسبب هبوب الرياح بجوار العين او البيئة ذات الهواء الجاف (مثل: التدفئة داخل المنزل)، التعرض للدخان او التراب. الجفاف ربما يكون من مضاعفات امراض العين الاخرى، مثل: امراض جفن العين وجحوظ العين (مثلما يحدث مع زيادة نشاط الغدة الدرقية). الجفاف المؤقت للفم ربما يصاحب العصبية، القلق والتنفس عبر الفم (كما يفعل العديد من الناس اثناء النوم). العديد من الادوية ايضا، يمكن ان تجعل الفم جافا.

            هذا الدليل سوف يغطي الاسباب الاكثر شيوعا لجفاف العين وجفاف الفم. بينما تكون هذه الاعراض اكثر شيوعا بين الاشخاص الاكبر سنا، الا ان هذا ليس امرا لا مفر منه، بينما ينخفض انتاج الدموع مع تقدم السن، فتكون الاعراض مرتبطة بالشيخوخة عادة. في الحقيقة، العديد من كبار السن يكون لديهم انتاج دموع ولعاب طبيعي تماما.

            من فضلك، خذ بالاعتبار ان هذه المعلومات لا يمكن ان تحل محل التقييم الذي يكون وجها لوجه مع مقدم الرعاية الصحية الخاص بك. هذا الدليل يهدف لتقديم معلومات مفيدة اثناء انتظار التقييم او يضيف الى ما تعرفه بعد زيارة الطبيب.
                        '
            ,
            '
            
            افرازات العين

            ناسف لانك تعاني من هذه المشكلة!

            يجب الانتباه الى ان هذه المعلومات، لا يمكن ان تغني عن التشخيص المباشر مع مقدم الرعاية الصحية الخاص بك. الهدف من هذا الدليل  تقديم معلومات مفيدة اثناء انتظار التشخيص، او بالاضافة الى ما تم تشخيصه فعلا بعد زيارة الطبيب.

            قبل توجيه سلسلة من الاسئلة اليك حول تفاصيل اعراضك،  من المهم ان تحدد ان كنت تعاني من مشكلة تتطلب رعاية فورية عاجلة، ام طارئة. فمثلا، افرازات العين التي يصاحبها تورم في اليدين، او الوجه، حكة او هرش، وخطوط في الجلد، تشير الى تفاعل حساسية شديد، يتطلب رعاية طبية فورية. وفقد الرؤية، او ضعف عضلات الوجه، او الم العين، هي اعراض خطيرة اخرى.

            ولحسن الحظ، فان معظم الاشخاص الذين يعانون من افرازات من العين، تكون لديهم المشكلة بسيطة – لكن مزعجة جدا — مثل البرد، او الحساسية.

            ويمكن ان يختلف نوع الافرازات طبقا للسبب. ويمكن للدموع المتزايدة ان تسبب افرازات العين المائية، بينما العدوى البكتيرية عادة ما تصاحبها افرازات سميكة وصفراء .
            '
            ,
            '
            
            الم العين

            مرحبا بك في دليلنا عن الم العين.

            يهدف هذا الدليل لتقديم معلومات مفيدة اثناء انتظار التقييم، او ان يضيف الى ما تعرفه فعلا بعد زيارة الطبيب. من فضلك خذ بعين الاعتبار ان هذه المعلومات، لا يمكن ان تحل محل التقييم الذي يكون وجها لوجه مع طبيبك الخاص بك.

            بداية سوف نحاول تحديد ان كنت تعاني من التهاب الملتحمة conjunctivitis (احمرار العين). حيث يمكن ان يسبب لك التهاب الملتحمة الشعور بعدم الراحة. عندها يكون سطح العين مثيرا للحكة، ويتحول الجزء الابيض من العين الى اللون الاحمر عادة. ولا يكون الالم الحقيقي شائعا مع التهاب الملتحمة البسيط.
            '
            ,
            //انف واذن وحنجره
            '
            يحدث السعال والبرد لدى معظم البالغين مرتين الى اربع مرات في السنة وهما اكثر تكررا لدى الاطفال. لست ملزما ان تراجع الطبيب اذا كنت تعاني من اعراض التهاب فيروسي دون مضاعفات في الجهاز التنفسي (الاذن، الانف، الجيوب الانفية، الحلق والصدر). من ناحية اخرى، يجب ان يقوم طبيبك بتقييمك اذا كنت تعاني من اعراض ترجح سبب اكثر خطورة، مثل: العدوى البكتيرية او اذا كانت اعراضك غير قابلة للعلاج بالعلاجات التي دون وصفة طبية او مع مرور الوقت. هدف هذا الدليل هو مراجعة اعراض السعال والبرد لديك والتعرف على انماط معينة من المرض، يوصى فيها بالتقييم من قبل الطبيب.
            '
            ,
            '
            مرحبا بك في دليل الاعراض عن جفاف الفم و/او العطش الزائد. يؤسفنا انك تعاني من هذه المشكلة!

            هذا الدليل مصمم للاشخاص الذين لاحظوا وجود جفاف الفم و/او العطش الزائد غير معروف السبب، سوف يبحث في المزيد عن هذه المشكلة. من فضلك، خذ بالاعتبار ان هذه المعلومات لا يمكن ان تحل محل التقييم الذي يكون وجها لوجه، مع مقدم الرعاية الصحية الخاص بك. هذا الدليل مقصود به تقديم معلومات مفيدة اثناء انتظار التقييم او يضيف الى ما تعرفه بعد زيارة الطبيب.
            
            هذا الدليل سوف يركز على جفاف الفم المستمر طوال الوقت. فالجفاف المؤقت للفم ربما يصاحب العصبية، القلق والتنفس عبر الفم (كما يفعل العديد من الناس اثناء النوم). يمكن ان يؤدي تناول وجبة مملحة او حارة الى عطش مؤقت (لكن شديد).
            
            من الجدير بالذكر ايضا، ان العديد من الناس يشربون بشكل متكرر اكثر من العادة. يشعرون بالعطش اذا كانوا غير قادرين على الشرب كعادتهم، حتى ان لم يكن هناك مرض حقيقي يتسبب في العطش. يمكن ان يكون من الصعب القول ان هذا هو سبب العطش او جفاف الفم عند شخص، دون استبعاد الاحتمالات الاخرى بداية.
            '
            ,
            '
            يربط الناس بين الم الاذن وعدوى الاذن عادة. رغم ذلك يمكن ان يحدث عدم الارتياح داخل او حول الاذن، بسبب مشاكل متعددة مختلفة. هذا الدليل سوف يغطي الاسباب الاكثر شيوعا لالم الاذن.

            بما ان عدوى الاذن هي سبب شائع لالم الاذن، دعنا نتناول هذا الاحتمال بداية.
            
            تحدث معظم انواع عدوى الاذن داخل الاذن. لا تكون هناك علامة على العدوى في الخارج عادة. يشير الاحمرار الالم والتورم، خارج الاذن الى وجود نوع مختلف من العدوى.
            '
            ,
            '
            مرحبا بك في دليلنا عن السعال المزمن. تم تصميم هذا الدليل من اجل الاشخاص الذين يعانون من سعال لمدة 3 اسابيع على الاقل.

            اي شخص يعاني من سعال مزمن، يجب ان يتم فحصه بواسطة الطبيب.
            '
            ,
            '
            التهاب الحلق شائع جدا، ويختفي دون علاج خاص عادة.

            وتكون العدوى الفيروسية شائعة جدا من بين انواع العدوى التي تسبب التهاب الحلق.  ويمكن بشكل اقل شيوعا، ان تعاني من عدوى بكتيرية تسمى بكتريا الحلق strep throat.
            
            وليست العدوى هي السبب الوحيد لالتهاب الحلق. فالحساسيات المسببة لاحتقان الانف مع التنفس من الفم، وارتداد حمض المعدة، هما سببان اخران لالتهاب الحلق.
            
            ونادرا، ما يمكن ان يكون التهاب الحلق علامة على وجود مرض خطير، يتطلب اهتماما طبيا فوريا. ويمكن ان تؤدي اسباب معينة لالتهاب الحلق الى انسداد الممرات الهوائية، وتوقف التنفس اذا تركت دون علاج.
            '
            ,
            '
            مرحبا بك في دليل فقدان السمع المفاجئ. ناسف لانك تعاني من هذه المشكلة!

            صمم هذا الدليل من اجل الاشخاص الذين يعانون من فقدان السمع حديثا، ويرغبون في معرفة المزيد عن هذا العرض. وهذا الدليل هو عن فقدان السمع المفاجئ وليس التدريجي. ولن تتم مناقشة العديد من اسباب فقدان السمع التدريجي هنا، مثل: فقدان السمع المصاحب للشيخوخة، او الامراض الوراثية النادرة.
            
            من فضلك خذ بالاعتبار ان هذه المعلومات لا يمكن ان تحل محل التقييم الذي يكون وجها لوجه مع مقدم الرعاية الصحية الخاص بك. هذا الدليل مقصود به تقديم معلومات مفيدة اثناء انتظار التقييم، او يضيف الى ما تعرفه فعلا بعد زيارة الطبيب.
            
            في هذا الدليل نقدم لك مجموعة من الاسئلة التي سوف تاخذك عبر بعض الاسباب الاكثر شيوعا لاعراضك. وسوف يغطي هذا الدليل الاسباب الاكثر شيوعا لفقدان السمع المفاجئ، ومع ذلك لن يغطي كل الاسباب.
            
            لذلك اذا لم تنطبق عليك اي من الحالات الموجودة في هذا الدليل، خذ باعتبارك انه لا يتم اكتشاف سبب احيانا. او ربما انت تعاني من سبب نادر لفقدان السمع، لم يتم ذكره هنا.
            '
            ,
            '
            مرحبا بك في المرشد حول صعوبة البلع.

            يمكن ان يصاحب صعوبة البلع الم، لكن لا يحدث هذا دائما. ويمكن ان يساعدك هذا الدليل في التعرف على بعض الاسباب التي قد تفسر اعراضك، وكذلك توقع التوصيات التي من الممكن ان يقدمها طبيبك من اجل تشخيصك.
            
            يجب تشخيص مشكلات البلع بواسطة الطبيب؛ لان صعوبة البلع يمكن ان تنشا من مشكلة طبية خطيرة. هذا الدليل يقصد به ان يستخدم كمرشد عند استشارتك للطبيب، وليس بديلا عن الرعاية المقدمة في العيادة.
            '
            ,
            '
            مرحبا بك في مرشد الاعراض هذا عن طنين الاذن. ناسف لانك تعاني من هذه المشكلة!

            بالرغم من انه يطلق على طنين الاذن عادة اسم الرنين في الاذن، الا ان تلك هي طريقة واحدة فقط يصف بها الناس طنين الاذن. ويذكر البعض سماع اصوات مختلفة في الاذن، او يعانون من طرق في الاذن. لذلك فاننا في هذا المرشد سوف نلتزم باللفظ الاكثر عموما، وهو الطنين.
            
            هناك اسباب متنوعة للطنين. وسوف يغطي هذا الدليل بعض الاسباب الاكثر شيوعا، لكن ليس بشكل شامل تماما، فلن تتم تغطية الاسباب النادرة. واضافة الى ذلك، ينتج الطنين عن كافة اسباب فقدان السمع تقريبا. فعلى سبيل المثال، ربما يؤدي تراكم الشمع الزائد في الاذنين، الى فقدان السمع والطنين. رغم ذلك، سوف يركز هذا الدليل على الطنين، وليس على فقدان السمع.
            
            وبالاجابة على سلسلة قصيرة من الاسئلة سوف يتم التعرف على الاسباب الاكثر شيوعا للطنين، والسبب الذي ينطبق عليك بشكل اكثر احتمالا. من فضلك ضع في اعتبارك ان هذا المرشد لا يقصد منه  ان يكون بديلا للتقييم وجها لوجه مع طبيبك. وتحتاج العديد من اسباب الطنين الى فحص شخصي، واختبارات لتشخيصها. 
            '
            ,
            //الصدر والظهر
            '
            الم الصدر

            التعرض لالم الصدر يتطلب تقييما دائما بواسطة طبيبك. واذا كان الالم شديدا، يجب ان تطلب المساعدة الطبية فورا.

            حتى ان كان الم الصدر غير شديد، تكون هناك حاجة الى الرعاية الطارئة، اذا كان الم الصدر ضاغطا، عاصرا، يصاحبه واحد او اكثر من الاعراض التالية:
            
                ضيق في التنفس
                عدم ارتياح، وخز في الذراعين ولا سيما الذراع اليسرى
                الم في الظهر
                ضيق او الم في الفك السفلي
                عرق غزير
                دوار او فقد في الوعي
            '
            ,
            '
            خفقان القلب

            مرحبا بك في دليلنا حول خفقان القلب.

            نحن لا نشعر بنبضات قلوبنا عادة. عندما نجهد انفسنا او نكون قلقين نتوقع ان نشعر بضربات قلوبنا، لانها تسرع وتكون اكثر قوة.
            
            ربما تكون هناك اوقات تشعر فيها بضربات قلبك بشكل غير متوقع. يطلق على هذا الاحساس اسم خفقان القلب. قد تشعر ان قلبك ينقبض بشكل سريع جدا، بطيء جدا، غير منتظم او يكون كنبض ثابت في صدرك. تعد هذه الاحاسيس جميعها اشكال لخفقان القلب.
            
            في هذا الدليل سوف توجه لك سلسلة من الاسئلة التي تقدم لك الاسباب الاكثر شيوعا، لحدوث خفقان القلب عندك.
            
            صممنا هذا الدليل ليساعدك على فهم الاسباب المحتملة لخفقان القلب عندك. وهو ليس بديلا لاستشارة طبيبك.
            '
            ,
            '
            
            الم اسفل الظهر

            مرحبا بك في دليل الام اسفل الظهر. نحن ناسف لان ظهرك يزعجك!

            هدف هذا الدليل هو تقديم المعلومات اثناء انتظار التقييم من قبل الطبيب او تقديم معلومات اضافية بعد رؤية طبيبك. من فضلك خذ في عين الاعتبار ان هذا الدليل لا يقصد به ان يكون بديلا للتقييم وجها لوجه مع طبيبك. التشخيصات التي نوقشت هنا هي من بين التشخيصات الاكثر شيوعا التي يمكن ان تفسر اعراضك، لكن القائمة ليست مكتملة تماما وربما تكون هناك احتمالات عديدة اخرى.

            اضافة الى ذلك، قد تكون هناك اكثر من حالة واحدة في الوقت نفسه. فعلى سبيل المثال، الشخص الذي يعاني من التهاب المفاصل الروماتويدي (rheumatoid arthritis)، يمكن ان يعاني من التهاب اوتار العضلات (tendonitis) ايضا. 
                        '
            ,
            '
            
            ضيق التنفس عند الكبار

            مرحبا بك في دليلنا عن ضيق التنفس.

            من خلال الاجابة عن سلسلة من الاسئلة سوف تتعرف على الاسباب المحتملة، لضيق التنفس البسيط الى المتوسط لديك.

            يتطلب ضيق التنفس الشديد وضيق التنفس الذي تصاحبه اعراض معينة اهتماما طبيا فوريا. اذا كنت تعاني من واحد او اكثر من الاعراض التالية، تكون هذه مشكلة طبية طارئة:

                                             ضيق شديد في التنفس

                                         صعوبة التحدث جملا كاملة

                                     الم في الصدر مع ضيق التنفس

          (تورم الوجه او البطن مع ضيق التنفس (تفاعل تحسسي محتمل
            '
            ,
            '
            الصفير مع التنفس عند الكبار

            مرحبا بك في مرشد الصفير المرافق للتنفس لدى البالغين.

            الصفير هو صوت ناتج عن انسداد جزئي لمجرى الهواء في الممرات الهوائية لاحدى الرئتين او كلتيهما. والاشخاص الذين لديهم صفير يعانون ايضا من بعض الاحساس بصعوبة التنفس ايضا. ويمكن ان يكون صوت الصفير مرتفعا جدا، لكن مستوى ارتفاع صوت الصفير، لا يتناسب مع شدة انسداد مسار الهواء. فعندما يكون مسار الهواء ضيقا جدا، ربما لا يتم سماع صوت صفير اطلاقا.

            ويهدف هذا المرشد الى مساعدتك على فهم السبب المحتمل لصفيرك، بافتراض انه لم يتم تشخيص مرض في الرئة عندك، مثل: الربو، او مرض في القلب، مثل فشل القلب.
            '
            ,
           // الذراعين واليدين
           '
           الم المرفق 
           
           سف لانك تعاني من الم المرفق!

            من فضلك خذ دقائق قليلة للاجابة عن بعض الاسئلة، وسوف يقدم هذا الدليل بعض الاسباب الاكثر شيوعا، ويقدم بعض المعلومات المفيدة. من فضلك ضع في حسبانك ان هذا الدليل لا يشكل بديلا للتشخيص المباشر من قبل طبيبك.

            والتشخيصات التي بحثت هي من بين التشخيصات الاكثر شيوعا التي يمكن ان تفسر اعراضك، لكن القائمة ليست مكتملة تماما، وربما تكون هناك احتمالات اخرى. واضافة الى ذلك، ربما يوجد هناك اكثر من سبب واحد في الوقت نفسه. فمثلا، الشخص الذي يعاني من التهاب المفاصل الروماتويدي rheumatoid arthritis، يمكن ان يعاني ايضا من اعتلال العصب الزندي ulnar neuropathy، لان تورم المرفق يضغط على التركيبات المحيطة.
                    '
           ,
           '
            الم اليد

            ناسف لانك تعاني من الم اليد.

            هدف هذا الدليل هو تقديم المعلومات اثناء انتظار التقييم مع الطبيب او تقديم معلومات اضافية بعد رؤية طبيبك. الرجاء الاخذ في عين الاعتبار بان هذا الدليل لا يقصد به ان يكون بديلا للتقييم وجها لوجه مع طبيبك.

            قد يحدث الم اليد لاسباب عديدة، منها: الكسور والعدوى التي هي من بين الاسباب الاكثر خطرا، بينما الالتواء والتهاب المفاصل من بين الاسباب الاكثر شيوعا. في نهاية هذا الدليل سوف نقدم لك روابط لمعلومات اكثر تفصيلا عن الاسباب الاكثر شيوعا لالم اليد، رغم ذلك، هناك اسباب نادرة لهذه الاعراض، سوف نذكرها هنا والتي تحتاج الى تقييم اكثر تفصيلا من الذي يقدمه هذا الدليل.
                    '
           ,
           '
            مشاكل الاظافر

            ناسف لمعرفتنا انك تعاني من مشكلة في اظافرك.

            الرجاء الاخذ في عين الاعتبار، بان هذا الدليل لا يقصد به ان يكون بديلا للتقييم وجها لوجه مع طبيبك. هدف هذا الدليل هو تقديم المعلومات اثناء انتظار التقييم مع الطبيب او معلومات اضافية بعد رؤية طبيبك.

            يمكن ان تحدث مشاكل الاظافر لعدد من الاسباب: التهاب الجلد، الظفر الناشب (ingrown nail) والصدفية هي من بين الاسباب الاكثر شيوعا. لكن العدوى هي من بين الاسباب الاكثر خطورة. يجب تقييم اي مشكلة في الاظافر، لا تتحسن مع مرور الوقت بواسطة الطبيب.
           '
           ,
           '   
            العامل الروماتويدي الايجابي

            مرحبا بك في دليل العامل الروماتويدي الايجابي.

            تم تصميم هذا الدليل من اجل الاشخاص الذين لديهم عامل روماتويدي ايجابي، والذين يرغبون في معرفة المزيد عن هذا الاختبار، وماذا يمكن ان تعني نتيجة هذا الاختبار.

            هدف هذا الدليل هو تقديم المعلومات اثناء انتظار التقييم بواسطة الطبيب، او تقديم معلومات اضافية بعد رؤية طبيبك. من فضلك ضع في اعتبارك، ان هذا الدليل لا يقصد به ان يكون بديلا للتقييم وجها لوجه مع طبيبك. والتشخيصات التي نوقشت هنا هي من بين التشخيصات الاكثر شيوعا، التي يمكن ان تفسر اعراضك، لكن القائمة ليست مكتملة تماما، وربما تكون هناك احتمالات عديدة اخرى. واضافة الى ذلك، ربما توجد هناك اكثر من حالة واحدة في الوقت نفسه.
           '
           ,
           ' 
            الم الكتف

            ناسف لانك تعاني من الم الكتف!

            هدف هذا الدليل هو تقديم المعلومات اثناء انتظار التشخيص بواسطة الطبيب، او تقديم معلومات اضافية بعد رؤية طبيبك. من فضلك ضع في اعتبارك ان هذا الدليل لا يقصد به ان يغني عن التشخيص المباشر من قبل طبيبك. والتشخيصات التي نوقشت هنا هي من بين التشخيصات الاكثر شيوعا التي يمكن ان تفسر اعراضك، لكن القائمة ليست مكتملة تماما، وربما تكون هناك احتمالات عديدة اخرى. واضافة الى ذلك، ربما توجد هناك اكثر من حالة واحدة في الوقت نفسه. على سبيل المثال، الشخص الذي يعاني من التهاب المفاصل الروماتويدي rheumatoid arthritis يمكن ان يعاني من التهاب اوتار العضلات tendonitis ايضا. 

            تكون الكتف معرضة للالم جزئيا بسبب تشريحها المعقد، وبسبب نطاق حركتها الاكبر من اي مفصل في الجسم. وتكون بعض هذه العضلات، او الاوتار، او الاكياس اسبابا شائعة لالم الكتف، حتى عندما يكون المفصل نفسه بحالة جيدة.
           '
           ,
           '    
            الم الرسغ

            ناسف لانك تعاني من الم الرسغ!

            هدف هذا الدليل هو تقديم المعلومات اثناء انتظار التشخيص الطبي، او تقديم معلومات اضافية بعد مراجعتك لطبيبك. من فضلك ضع في اعتبارك ان هذا المرشد ليس بديلا عن الاستشارة الطبية لدى طبيبك الخاص. والتشخيصات التي نبحثها هنا هي من بين التشخيصات الاكثر شيوعا التي يمكن ان تفسر اعراضك، لكن القائمة ليست مكتملة تماما، وربما تكون هناك احتمالات عديدة اخرى. واضافة الى ذلك، ربما توجد هناك اكثر من حالة واحدة في الوقت نفسه. فعلى سبيل المثال، الشخص الذي يعاني من التهاب المفاصل الروماتويدي rheumatoid arthritis، يمكن ان يعاني من التهاب اوتار العضلات tendonitis ايضا. 

            ويكون الرسغ معرضا للالم، لانه كثيرا ما يستخدم بشكل زائد، وله تركيب تشريحي معقد؛ وذلك نتيجة لوجود العديد من التركيبات المزدحمة في مكان صغير.
           '
           ,
            // البطن والحوض
            ' 
            ارتداد حمض المعدة

            مرحبا بك في دليل علاج ارتداد حمض المعدة

            تم تطوير هذا البرنامج الارشادي من قبل مدرسة هارفارد الطبية. اذا كنت تعاني من حرقة المعدة بشكل متكرر، او اعراض مرض ارتداد حمض المعدة الى المريء، فان هذا الدليل يمكن ان يقدم لك منهج علاج مناسب في دقائق معدودة فقط.
            
            اذا كان التشخيص واضحا، فان معظم علاجات ارتداد المريء يمكن ان تبدا دون طبيب. ورغم ذلك، فان هذا الدليل يستخدم كمرشدا لدى استشارتك الطبيب وليس بديلا للرعاية المقدمة في العيادة
            '
            ,
            ' 
            غازات الامعاء

            اذا كنت تعاني من تجشؤ متكرر او خروج غازات من المستقيم، فان هذا الدليل يمكن ان يساعدك على فهم من اين تاتي غازاتك وكيف يمكنك تقليلها؟

            التجشؤ، اصوات المعدة، خروج الغازات من الامعاء السفلية قد تكون احداثا مزعجة، لكنها من النادر ان تكون بسبب مشكلة صحية. في اغلب الاحيان تكون الغازات نتيجة للاطعمة التي تاكلها وكمية الهواء التي تبتلعها. اذا كانت اعراض الغازات لديك ملاحظة او اذا كنت تعاني من اعراض اخرى ليس لها تفسير، فسيكون من الافضل لك ان تستشير طبيبك. فهذا الدليل يستخدم كمرشد لدى استشارتك الطبيب وليس بديلا للرعاية المعتمدة على العيادة.
            '
            ,
            '           
            الدم في البول عند الرجال

            مرحبا بك في دليلنا للرجال الذين لاحظوا وجود دم في البول الخاص بهم.

            اللفظ الطبي لوجود الدم في البول هو hematuria. البول الذي يحتوي على دم، يمكن ان يبدو قرمزيا، احمر، ماروني او حتى داكن اللون فيبدو مثل الكولا. قد تشاهد او لا تشاهد جلطات الدم التي يمكن ان تبدو مثل مسحوق القهوة. قد يكون البول الاحمر الناتج عن اطعمة او ادوية محددة، بمثابة حالة  نادرة. على الارجح سوف يرغب طبيبك في تحليل عينة من البول الخاص بك؛ للتاكد من ان اللون الاحمر هو بسبب الدم.

            عدوى المسالك البولية وحصوات الكلية ومشاكل البروستاتا، هي اسباب شائعة لهذا العرض. اما الاقل شيوعا، فهو ان يشير الدم الذي في البول الى حالة اكثر خطورة.

            على الرجال جميعهم الذين يعانون من دم في البول كمشكلة جديدة ان يزوروا الطبيب. حتى ان كان لديك دم في البول في الماضي، اتصل بطبيبك مرة اخرى.

            القصد من هذا الدليل هو تقديم معلومات مفيدة اثناء انتظار التقييم او الاضافة الى ما تعرفه فعلا بعد زيارة الطبيب. من فضلك الاخذ في الحسبان ان هذه المعلومات، لا يمكن ان تغني عن التقييم المباشر من قبل الطبيب.
            '
            ,
            '        
            فحص سرطان القولون

            مرحبا. دليلنا سوف يساعدك في اختيار الطريقة التي ترغب بها، من اجل الكشف عن سرطان القولون والمستقيم.

            هنا بعض الحقائق التي ستساعدك على فهم اهمية ان يتم الكشف عن سرطان القولون:

                سرطان القولون هو ثاني سبب مؤد للوفاة، من بين وفيات السرطان في الولايات المتحدة.
                ما يقدر بـ 147000 حالة جديدة، سيتم تشخيصها هذا العام. حوالي 57000 شخص سوف يموتون بسبب هذا المرض.
                حوالي 5% من الامريكيين يتوقع ان يصابوا بهذا المرض خلال فترة حياتهم. حيث يكون الرجال معرضون لخطر الاصابة اكثر بقليل من النساء.

                يبدا خطر الاصابة في سرطان القولون بالازدياد بعد سن الـ 40 عام. يزداد خطر الاصابة بصورة حادة بين سن 50 الى 55 عاما، بعدها يتضاعف خطر الاصابة بسرطان القولون مع مرور كل عقد مقبل من العمر.

            الخضوع لفحوصات الكشف المبكر عن سرطان القولون، هي واحدة من افضل الطرق لتقليل مخاطر الاصابة بهذا المرض الهام. هي ايضا طريقة اسهل مما يعتقده العديد من الناس.
            '
            ,
            '           
            الامساك عند الكبار

            هدف هذا الدليل هو تقديم المعلومات والنصيحة للاشخاص الذين يعانون من اعراض الامساك (Constipation).هذا الدليل لا يشكل بديلا عن الاستشارة الطبية لدى الطبيب الخاص.

            يمكن لهذا الدليل ان يشكل مكملا للتقييم لدى الطبيب.

            دليل الامساك هذا يقدم توصيات متعلقة بالتقييم والعلاج، اعتمادا على الاجابات التي تقدمها على سلسلة الاسئلة.

            عدد الاسئلة يتحدد من خلال اعراضك. سوف يتم سؤالك 12 سؤالا على الاقل، مع اسئلة اضافية متعلقة بعمرك، جنسك او اعراضك.

            الوقت المطلوب لاكمال الدليل: من 10 الى 20 دقيقة.
            '
            ,
            '            
            الاسهال

            هذا الدليل مصمم؛ كي يساعدك على فهم الاسباب الاكثر احتمالا لاعراضك.

            اذا كان الاسهال لديك شيئا اساسيا او اذا كنت تعانين من اعراض اخرى غير معروفة السبب، مثل: الارهاق، الم البطن، فقد الوزن، دم مع البراز او اذا استمر الاسهال لديك لمدة اطول من خمسة ايام، يجب ان تزوري طبيبك لمناقشة اعراضك. هذا الدليل يقصد به ان يستخدم كمرشد لدى استشارتك الطبيب وليس بديلا للرعاية المقدمة في العيادة.
            '
            ,
            '
           صعوبة التبول

            مرحبا بك في هذا الدليل عن صعوبة التبول.

            صعوبة التبول هي مشكلة شائعة. يمكن ان تكون بسبب احوال تصيب الكلية، المثانة البولية او غدة البروستاتا (عند الرجال). عدوى المسالك البولية، حصى الكلية ومشكلات البروستاتا هي اسباب شائعة لهذا العرض. عند بعض الناس، توجد اكثر من حالة واحدة مسببة.

            اي شخص يعاني من صعوبة في التبول لمدة اكثر من 24 الى 48 ساعة، يجب ان يراجع الطبيب. يهدف هذا الدليل لتقديم معلومات مفيدة اثناء انتظار التقييم او يضيف الى ما تعرفه بعد زيارة الطبيب.

            من فضلك ضع في الحسبان ان هذه المعلومات، لا يمكن ان تحل محل التقييم الذي يكون وجها لوجه مع مقدم الرعاية الصحية الخاص بك.
            '
            ,
            '    
            ضعف العضلات

            يؤسفنا انك تعاني من ضعف في العضلات.

            هذا الدليل معد للاشخاص الذين يشعرون بضعف عام. اي ان الاعراض غير محددة في منطقة واحدة او بعض المناطق القليلة، لكن تكون في الجسم كله غالبا او على الاقل في مناطق عديدة.

            هذا الدليل سوف يتعامل مع الضعف الحقيقي، اي: انخفاض قوة العضلات. اعراض ضعف العضلات، تشمل: صعوبة القيام من على الكرسي، تسريح الشعر، حمل شيء الى رف مرتفع او تنزيل الاشياء. قد يؤدي هذا الى سقوط جفن العين العلوي ايضا، هذا يعتمد على اي من العضلات ضعيفة.

            الاشخاص الذين يعانون من اعراض اخرى، مثل: الارهاق (التعب او الشعور بالوهن)، الرغبة في النوم، الاكتئاب ربما يقولون عادة انهم يشعرون بالضعف، قد يكون من الصعب التفريق بين البعض من هذه وضعف العضلات الحقيقي. لذلك، اذا لم تكن متاكدا ان هذا الدليل مناسبا لك، قم بالبدء في الدليل وافحص اذا كانت الاعراض التي يغطيها تنطبق عليك.

            هناك نقطة اخرى قبل المضي قدما: بعض الناس يشعرون بالضعف بسبب الالم. الضعف والالم يمكن بالتاكيد ان يحدثا معا، لكن هذا الدليل لا يركز على كل سبب من اسباب الضعف العام.
            '
            ,
            '      
            الم مفصل الحوض

            يؤسفنا لانك تعاني من الم مفصل الحوض!
            الهدف من هذا الدليل هو تقديم المعلومات اثناء انتظار التقييم لدى الطبيب، او تقديم معلومات اضافية بعد رؤية طبيبك. من فضلك خذ في عين الاعتبار ان هذا الدليل لا يقصد به ان يكون بديلا للتقييم وجها لوجه مع طبيبك. والتشخيصات التي نوقشت هنا هي من بين التشخيصات الاكثر شيوعا التي يمكن ان تفسر اعراضك، لكن القائمة ليست مكتملة تماما، وربما تكون هناك احتمالات اخرى.

            اضافة الى ذلك، ربما يوجد هناك اكثر من سبب واحد في الوقت نفسه. على سبيل المثال، الشخص الذي يعاني من التهاب المفاصل الروماتويدي، يمكن ان يعاني من التهاب اوتار العضلات ايضا.

            يكون مفصل الحوض معرضا للالم جزئيا؛ لانه معقد التركيب، ولان نطاق حركته كبير. وتكون بعض هذه التركيبات التي تشمل كيس المفصل، او العضلات، او اوتار العضلات، او الاربطة اسبابا شائعة لالم مفصل الحوض حتى ان كان المفصل نفسه على ما يرام.
                        '
            ,
            '     
            فقد السيطرة على التبول عند الرجال

            مرحبا بك في هذا الدليل، حول فقد القدرة على التحكم في التبول عند الرجال.

            فقد القدرة على التحكم في التبول او فقد القدرة على التحكم في المثانة (يعرف باسم السلس البولي - incontinence ايضا) هو مشكلة شائعة، لا سيما عند الرجال. يقدر انه ما بين 1.5 الى 5% من الرجال الاصغر من 65 عاما عمرا، يعانون من مشكلات في التحكم في التبول. بعد سن 65 سنة يزداد هذا الرقم الى 15 – 30%، ما يصل الى نصف الرجال  في بيوت المسنين، يفقدون القدرة على التحكم في البول لبعض الوقت او كله.

            ربما يحدث فقد القدرة على التحكم في البول لعدد من الاسباب. ربما تكون مشكلات المثانة او غدة البروستاتا هي الاكثر شيوعا، لكن السبب عند العديد من الرجال خارج المسالك البولية. على سبيل المثال، يمكن ان يقلل الامساك الشديد وادوية معينة القدرة على التحكم في التبول. عند بعض الرجال، توجد اكثر من مشكلة واحدة.

            من المهم ان نعي ايضا، ان بعض اسباب السلس البولي تكون بسيطة جدا، بينما تكون الاخرى خطيرة. بالطريقة نفسها، ربما يمكن علاج بعض اسباب السلس بسهولة، بينما تستمر الاخرى طويلا.

            يجب على الرجال الذين يعانون من فقد القدرة على التحكم في التبول ان يراجعوا طبيبهم. يهدف هذا الدليل الى تقديم معلومات مفيدة اثناء انتظارك لتقييم الطبيب او الاضافة الى المعلومات التي حصلت عليها فعلا بعد تقييم الطبيب. من فضلك، ضع في اعتبارك ان هذه المعلومات لا يمكن ان تحل محل التقييم وجها لوجه مع مقدم الرعاية الصحية الخاص بك.
            '
            ,
            '  
            ورم او الم في كيس الخصيتين

            كيس الصفن هو الجيب الذي يقع اسفل القضيب ويحتوي على الخصيتين. يمكن ان تكون المشكلات التي تصيب الخصيتين وكيس الصفن مقلقة في البداية. لكن الجيد انها غالبا لا تكون حالات خطيرة. للتاكد يجب ان يتصل الرجل بطبيبه اذا اكتشف ورما جديدا او كان يعاني من الم مستمر في كيس الصفن.

            سوف يقدم لك هذا الدليل الاسباب الاكثر شيوعا لاعراضك مع الافعال المقترحة، وفقا لاجاباتك على سلسلة قصيرة من الاسئلة. المعلومات الموجودة في هذا الدليل لا تغني عن التشخيص المباشر بواسطة مقدم الرعاية الصحية.
            '
            ,
            '          
            كثرة التبول او التبول المؤلم عند الرجال

            التبول المؤلم او المتكرر هو مشكلة شائعة، لا سيما عند الرجال الاكبر سنا. عدوى المسالك البولية وحصى الكلية، مشكلات البروستاتا جميعها، يمكن ان تؤدي الى هذه الاعراض. يمكن ان يكون التبول المتكرر دون الم ايضا، اثرا جانبيا لادوية معينة او عرض لمرض السكري.

            يجب على الرجال الذين يعانون من مشاكل جديدة، التبول المؤلم او المتكرر ان يراجعوا طبيبهم. يقدم هذا الدليل معلومات مفيدة اثناء انتظار التقييم او يضيف الى المعلومات التي تحصل عليها بعد زيارة الطبيب.

            من فضلك ضع في الاعتبار ان هذه المعلومات، لا يمكن ان تغني عن التشخيص المباشر مع مقدم الرعاية الصحية الخاص بك.

            يمكن ان يكون الالم او الحرقة مع التبول والتبول المتكرر بسبب الحالة المرضية نفسها. رغم ذلك، من المهم ان نركز على عرض واحد او اخر.
            '
            ,
            '      
            الم القضيب، قروحه، افرازاته او اورامه

            يكون الم القضيب، تغيرات الجلد والافرازات مرتبطة بتهيج او عدوى غالبا. بما ان كلا من هذه الاعراض، يمكن ان تحدث بسبب مرض منقول جنسيا، فعليك ان تراجع طبيبك.

            هدف هذا الدليل هو تقديم المعلومات اثناء انتظار التشخيص بواسطة الطبيب او تقديم معلومات اضافية بعد مراجعة الطبيب. من فضلك ضع في اعتبارك، ان هذا الدليل لا يقصد به ان يغني عن التشخيص المباشر من قبل طبيبك. التشخيصات التي بحثت هنا هي من بين التشخيصات الاكثر شيوعا، التي يمكن ان تفسر اعراضك، لكن القائمة ليست مكتملة تماما، قد تكون هناك احتمالات عديدة اخرى.
                        '
            ,
            '
            نزيف المستقيم       

            اذا كنت تعاني من نزيف في المستقيم، فان هذا الدليل يمكن ان يساعدك في التعرف على بعض الاسباب الاكثر احتمالا لتفسير اعراضك. وربما يساعدك ايضا على تفسير التوصيات التي ربما يقدمها طبيبك من اجل التقييم والعلاج. من فضلك ضع في اعتبارك، ان هذا الدليل لا يغني عن التقييم المباشر من قبل طبيبك.

            ويشير نزيف المستقيم الى رؤية دم داكن، او احمر عند التبرز، او  بين مرات التبرز. وقد يلاحظ الدم في دورة المياه، او في مناديل دورة المياه.

            ويجب ان تتصل بطبيبك دائما، اذا لاحظت وجود نزيف المستقيم.
            '
            ,
            '        
            الم المستقيم والحكة

            مرحبا بك في دليل الم المستقيم وحكته.

            يمكن ان يساعدك هذا الدليل في التعرف على الاسباب الاكثر احتمالا لتفسير اعراضك، والتنبؤ بالتوصيات التي ربما يقدمها طبيبك.

            ويمكن ان تحدث حكة المستقيم، او الم المستقيم البسيط اثناء التبرز الطبيعي احيانا. رغم ذلك، لا يكون الم المستقيم الشديد، او المستمر، طبيعيا، ومن الممكن ان يكون بسبب مشكلة طبية خطيرة احيانا. ومن اجل الالم الشديد، او تهيج الجلد المستمر حول الشرج، يجب ان تطلب التقييم من قبل طبيبك. هذا الدليل يقصد به ان يستخدم كمرشد لدى استشارتك الطبيب، وليس بديلا للرعاية المعتمدة على العيادة.

            واذا كانت عرضك الاكبر هو نزيف المستقيم، الامساك او الاسهال فربما تجد معلومات مفيدة اكثر في ادلتنا الاخرى.
            '
            ,
            '                 
            الالم المتكرر في البطن

            من الممكن ان  تنشا النوبات المتكررة من الم البطن لاسباب طبية متنوعة، بما فيها بعض الحالات الخطيرة. يحتاج اي شخص يعاني من الم متكرر في البطن الى تقييم طبي بواسطة الطبيب. من فضلك خذ وقتا اليوم؛ لترتيب موعد للتقييم الطبي، اذا لم تكن قد قمت بذلك فعلا.

            يمكن ان يتطلب تشخيص الم البطن، والتقيؤ عدة زيارات للطبيب، واختبارات متعددة. وسوف يساعدك هذا الدليل في التعرف على مميزات الم بطنك التي تكون مفاتيح لمعرفة سببه، وتقديم رؤية حول الكيفية المحتمل ان يسير بها التقييم الطبي. لم يتم انشاء هذا الدليل ليحل محل الرعاية المعتمدة على العيادة.

            ويناقش هذا الدليل النوبات المتكررة لالم البطن الذي يحدث خلال عدة اسابيع الى عدة شهور. واذا كان المك احدث من هذا، او اذا كنت تعاني حاليا من الم اكثر شدة من المعتاد، فمن فضلك قم بزيارة دليلنا المسمى "شرح الم البطن الحديث الشديد".

            لم يتم انشاء هذا الدليل ليحل محل الرعاية المعتمدة على العيادة. وانما غرض هذا الدليل هو مساعدتك في الحصول على الفائدة الكبرى من التقييم الطبي بواسطة طبيبك.
            '
            ,
            '
            الم البطن الشديد حديث الظهور

            مرحبا بك في دليلنا، حول الم البطن الشديد حديث الظهور.

            يحتاج الم البطن الشديد الذي ظهر حديثا الى تشخيص دقيق بواسطة الطبيب. ويكون عادة اشارة الى وجود مرض خطير. لا يحل هذا الدليل محل الرعاية المقدمة في العيادة.

            اذا كنت تعاني من الم شديد في البطن الذي ظهر حديثا، فربما يكون هذا الالم مرعبا بالنسبة لك بسبب غموضه، لان البطن يحتوي على العديد من الاعضاء المهمة التي يمكن ان تكون مصدرا للالم. يبدو انه من الامر العسير بالنسبة للطبيب ان يشخص مصدر الالم وفي الحقيقة فان هناك اكثر من مئة حالة طبية تؤدي الى الالم بشكل شائع.

            بالرغم من القائمة الطويلة للاسباب المحتملة لالم البطن، الا ان طبيبك يكون قادرا على تضييق نطاق الاحتمالات الى قائمة صغيرة بعد التقييم الاولي. قد تكون تجربتك اقل تخويفا اذا فهمت الطريقة التي يتعامل بها الطبيب مع مشكلتك واسباب طلب اختبارات معينة.

            غرض هذا الدليل هو مساعدتك على فهم الطريقة الشائعة التي يتعامل فيها الاطباء مع الم البطن. قد يمكنك هذا الدليل ايضا من تقديم تاريخ مرضي اكثر افادة اثناء التشخيص بواسطة الطبيب.

            تم تخصيص هذا الدليل للاشخاص الذين يعانون من الم جديد في البطن – الالم الموجود منذ اقل من اسبوعين. اذا كان المك موجودا لفترة اطول او متكرر، فمن فضلك قم بزيارة دليلنا
            '
            ,
            '       
            مستضد البروستاتا

            مرحبا بك في هذا الدليل عن اختبار مستضد البروستاتا.

            اختبار مستضد البروستاتا هو اختبار دم يستخدم بواسطة العديد من الاطباء؛ لفحص  سرطان البروستاتا. اذا كان قد تم فحص مستوى مستضد البروستاتا لديك، ربما تكون قد اخبرت ان النتائج "طبيعية" او "غير طبيعية". رغم ذلك، يرغب بعض الرجال في معرفة المزيد عن معنى مستوى مستضد البروستاتا لديهم.

            يقدم هذا الدليل المزيد من المعلومات عن مستويات مستضد البروستاتا، وما الذي يعتبر مطمئنا، او مقلقا بالنسبة للرجال في اعمار مختلفة.

            خذ باعتبارك ان مستضد البروستاتا هو اداة فحص، عندما تستخدم وحدها ببساطة، لا تستطيع الاجابة عن السؤال: اكنت تعاني من سرطان البروستاتا ام لا؟ رغم ذلك، تكون مستويات مستضد البروستاتا مفيدة عادة من اجل تقرير اي الرجال يحتاجون الى اختبارات اخرى او تقييما اخر. يمكن ان تكون مستويات مستضد البروستاتا المرتفعة علامة على وجود سرطان البروستاتا، لكنها يمكن ان تعكس وجود ورم حميد في البروستاتا ايضا وعدوى البروستاتا ايضا. تحليل عينة من البروستاتا هو الذي يخبرنا فقط اذا كنت تعاني ام لا من سرطان البروستاتا او ان هناك سببا اخر لارتفاع مستضد البروستاتا.

            من المهم ايضا معرفة ان العديد من الاطباء لا يتفقون على اختبار مستضد البروستاتا؛ لان نتائج اختبار مستضد البروستاتا، يمكن ان تكون مضللة، لانه يوجد شك بخصوص اذا كان العلاج المكثف لسرطان البروستاتا، مفيدا للعديد من الرجال كبار السن ايضا. بالرغم من ان هذا الدليل صمم من اجل الرجال الذين تم فحص مستضد البروستاتا لديهم، الا انه يجب ان تضع في اعتبارك، ان اختبار مستضد البروستاتا لا يكون مفيدا لكل الناس. اذا كانت لديك اسئلة بخصوص اختبار مستضد البروستاتا، يجب ان تتحدث مع مقدم الرعاية الصحية الخاص بك.

            لفهم نتائج مستضد البروستاتا لديك، سوف نوجه لك مجموعة من الاسئلة عنك وعن تاريخك المرضي. قبل ان تبدا ربما يكون من المفيد ان تضع احدث نتيجة لمستضد البروستاتا امامك ونتائج اي اختبارات سابقة لمستضد البروستاتا ايضا.

            سوف نبدا بمعرفة عمرك؛ لان مستويات مستضد البروستاتا تميل الى الارتفاع بتقدم العمر والحدود الطبيعية ترتفع ايضا.
            '
            ,
             // القدمين والساقين
             '          
            الم القدم
            
            ناسف لانك تعاني من الم القدم!
            
            من فضلك ضع في حسبانك، ان هذا المرشد لا يقصد به ان يكون بديلا للتشخيص المباشر من قبل طبيبك. وهدف هذا المرشد هو تقديم المعلومات اثناء انتظار التشخيص بواسطة  الطبيب، او معلومات اضافية بعد مراجعة طبيبك، او طبيبتك.
            
            قد يحدث الم القدم لاسباب عديدة، منها: الكسور والعدوى من بين الاسباب الاكثر خطرا، بينما الالتواء والتهاب المفاصل من بين الاسباب الاكثر شيوعا. في نهاية هذا الدليل سوف يتم تقديم روابط لمعلومات اكثر تفصيلا عن الاسباب الاكثر شيوعا لالم القدم، ورغم ذلك هناك اسباب نادرة لهذه الاعراض، سوف نذكرها هنا، وتحتاج الى تقييم اكثر تفصيلا عن الذي يقدمه هذا الدليل.
            
            وتكون الاعراض التحذيرية التي يمكن ان تشير الى وجود اصابة خطيرة لعظمة، او رباط هي الالم الشديد، او التورم، او الكدمات، او عدم القدرة على حمل الاشياء. وعندما توجد الحمى، تكون العدوى من المخاوف الكبرى. رغم ذلك، لا يكون لدى معظم الاشخاص الذين يعانون من الم القدم، سبب خطير. وفي الحقيقة، يعاني العديد من الناس من الالم بسبب الاحذية غير المناسبة، او الضيقة جدا، حاول تغيير حذائك الى حذاء ببطانة اكثر، يدعم ويمنح حيزا لقدميك،  
            '
             ,
             '
            النقرس

            يؤسفنا ان نسمع انك تعاني من النقرس.

            هدف هذا الدليل، هو تقديم المعلومات اثناء انتظار التقييم مع الطبيب، او معلومات اضافية بعد رؤية طبيبك. من فضلك الاخذ بعين الاعتبار ان هذا الدليل لا يقصد به ان يكون بديلا للتقييم وجها لوجه مع طبيبك.

            اولا، بعض المعلومات الاساسية عن هذا الدليل، وعن الحالة نفسها:

            النقرس هو حالة يحدث فيها التهاب لمفصل، او اكثر بسبب ترسب بلورات حمض اليوريك فيها. وحمض اليوريك هو منتج طبيعي، من الوظائف الطبيعية للجسم، ويزال من الجسم بواسطة الكلى.
             '
             ,
             ' 
             الم الركبة
             
             ناسف لانك تعاني من الم الركبة!
             
             هدف هذا الدليل هو تقديم المعلومات اثناء انتظار التقييم بواسطة الطبيب او تقديم معلومات اضافية بعد رؤية طبيبك. من فضلك خذ في عين الاعتبار ان هذا الدليل لا يقصد به ان يكون بديلا للتقييم وجها لوجه مع طبيبك. التشخيصات التي نوقشت هي من بين التشخيصات الاكثر شيوعا التي يمكن ان تفسر اعراضك، لكن القائمة ليست مكتملة تماما، قد تكون هناك احتمالات عديدة اخرى. اضافة الى ذلك، ربما تكون هناك اكثر من حالة واحدة في الوقت نفسه. على سبيل المثال، الشخص الذي يعاني من التهاب المفاصل الروماتويدي (rheumatoid arthritis)، يمكن ان يعاني من التهاب اوتار العضلات (tendonitis) ايضا.  
             '
             ,
             ' 
             تورم القدم الحاد
             
             مرحبا بك في دليلنا للاشخاص الذين يعانون من تورم جديد في الساق، يسمى تورم الطرف السفلي (lower extremity edema) ايضا. ناسف لانك تعاني من هذه المشكلة!
             
             ربما تكون قد لاحظت وجود تورم في اي جزء من احدى الساقين او كلتيهما، هذا يشمل القدمين والكاحلين. اذا كنت تعاني من تورم القدم و/او الكاحل و/او الساق منذ وقت، فربما يظل هذا الدليل مفيدا، لكن التركيز سيكون على الاعراض الجديدة.
             
             هناك عدة اسباب لتورم الطرف السفلي. سوف يغطي هذا الدليل بعض الاسباب الاكثر شيوعا، لكنه ليس شاملا تماما، فلن تتم تغطية الاسباب النادرة. اضافة الى ذلك، ضع في اعتبارك انه ربما يكون هناك اكثر من سبب واحد للتورم.
             
             من فضلك خذ في عين الاعتبار، ان هذا الدليل لا يقصد به ان يكون بديلا للتقييم وجها لوجه مع طبيبك. تحتاج العديد من اسباب تورم الساق والقدم الى فحص شخصي واختبارات لتشخيصها.
             '
             ,
             ' 
             الالتهاب العظمي المفصلي للركبة

             مرحبا بك في هذا الدليل عن الالتهاب العظمي المفصلي (الفصال العظمي - osteoarthritis) (مرض المفاصل التنكسي - degenerative joint disease) للركبة.
             
             هذا الدليل معد للاشخاص الذين يعرفون انهم يعانون من الالتهاب العظمي المفصلي ويرغبون في معرفة المزيد عن هذه الحالة وما يمكنهم القيام به لمواجهته.
             
             من فضلك خذ بعين الاعتبار ان هذه المعلومات، لا يمكن ان تحل محل التقييم الذي يكون وجها لوجه مع مقدم الرعاية الصحية الخاص بك. هدف هذا الدليل تقديم معلومات مفيدة اثناء انتظار التقييم او ان يضيف الى ما تعرفه بعد زيارة الطبيب.             '
             ,
             '
             الركبة المزمن

             مرحبا بك في هذا الدليل عن تورم الركبة المستمر. ناسف لانك تعاني من هذه المشكلة!
             
             هدف هذا الدليل هو تقديم المعلومات اثناء انتظار التقييم بواسطة الطبيب، او تقديم معلومات اضافية بعد رؤية طبيبك. الرجاء الاخذ بعين الاعتبار، ان هذا الدليل لا يقصد به ان يكون بديلا للتقييم وجها لوجه مع طبيبك.
             
             اولا، بعض المعلومات الاساسية عن هذا الدليل، وعن تورم الركبة:
             
             ربما يحدث تورم في الركبة لعدة اسباب. واذا كنت تعاني من تورم جديد في الركبة لسبب غير معروف بعد اصابة كبيرة، او اذا كنت تعاني من حمى، فعليك التوجه فورا لرؤية طبيبك.
             
             قد يحدث تمزق الاربطة، او تلف الغضاريف، او الكسور بعد الصدمة، مما يتطلب علاجا عاجلا، ويكون هذا صحيح بشكل خاص، اذا كنت غير قادر على تحمل الوزن.
             
             سوف يركز هذا الدليل على تورم الركبة المستمر، بمعنى تورم الركبة المستمر لاكثر من اسبوعين، او ثلاثة.
             '
             ,
             '
             الم الكاحل

             نحن ناسف لان كاحلك يزعجك!
             
             من فضلك خذ بالاعتبار ان هذا الدليل لا يشكل بديلا للاستشارة الطبية لدى طبيبك. وانما هدفه تقديم المعلومات اثناء انتظار التقييم مع الطبيب، او معلومات اضافية بعد رؤية طبيبك او طبيبتك.             '
             ,

        ];

        $categories =[
            1,
            2,
            2,
            6,
            4,
            8,
            5,
            2,
            3,
            3,
            3,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            7,
            7,
            6,
            7,
            7,
            6,
// 25 is done
            6,
            1,
            6,
            6,
            6,

            8,
            8,
            9,
            8,
            9,

            8,
            9,
            2,
            6,
            9,

            9,
            9,
            9,
            9,
            9,

            8,
            8,
            9,
            6,
            6,

            6,
            6,
            6,
            6,
            6, 
          
        ];

        for($i = 0;$i<count($titles);$i++){
            $add = new Disease;
            $add ->title = $titles[$i];
            $add ->description = $descriptions[$i];
            $add ->category_id = $categories[$i];

            $add ->save();
        }
    }
}

