<?php
use App\Body;
use Illuminate\Database\Seeder;


class humanBodySeeder extends Seeder
{
     /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
       
        $titles =[
            'الجهاز العصبى',
            'الجهاز الدورى',
            'الجهاز المناعى',

            'الجهاز الهضمى',
            'الجهاز البولى',
            'الجهاز التنفسى',

            'الجهاز الليمفاوى',
            'الجهاز التناسلى',
            'الغدد الصماء',

            'الجهاز اللحافى',
            'الجهاز الهيكلى والعضلى'
            
        ];

        $descriptions =[
            '

            هو مجموعة معقدة من الأعصاب والخلايا المتخصصة المعروفة باسم الخلايا العصبية التي تنقل إشارات بين أجزاء مختلفة من الجسم.
            يتكون الجهاز العصبي من جزئين:
            
                 الجهاز العصبي المركزي:  يتكون الجهاز العصبي المركزي من الدماغ والحبل الشوكي والأعصاب.
                 الجهاز العصبي المحيطي: يتكون الجهاز العصبي المحيطي من الخلايا العصبية الحسية، العقد (مجموعات من الخلايا العصبية) والأعصاب التي تتصل بعضها البعض والجهاز العصبي المركزي.
            
            يقوم الجهاز العصبي بتنظيم بعض عمليات الجسم مثل ضغط الدم ومعدل التنفس، والتي تعمل دون جهد واعي، ويتكون النظام الجسدي من الأعصاب التي تربط الدماغ والحبل الشوكي مع العضلات والمستقبلات الحسية في الجلد.
             ',
            '

            هو شبكة واسعة من الأعضاء والأوعية المسؤولة عن تدفق الدم والمغذيات والهرمونات والأكسجين والغازات الأخرى من وإلى الخلايا. وبدون نظام الدورة الدموية، فإن الجسم لن يكون قادرا على مكافحة المرض أو الحفاظ على بيئة داخلية مستقرة - مثل درجة الحرارة المناسبة ودرجة الحموضة - والمعروفة باسم التوازن.
            يشكل القلب والدم والأوعية الدموية الدورة الدموية ككل. وتشمل الدورة الدموية الرئوية، "حلقة" من خلال الرئتين حيث يتم تصفية أكسجين الدم، كما أنه يشمل الدورة الدموية النظامية، التي تمر عبر بقية الجسم لتوفير الدم المؤكسج.
            ويرسل نظام الدورة الدموية الرئوي الدم المستنفد من الأكسجين بعيدا عن القلب من خلال الشريان الرئوي إلى الرئتين ويعيد الدم المؤكسج إلى القلب من خلال الأوردة الرئوية.
            
            هل تعلم: أن جسم الإنسان البالغ يضم حوالي 4.5- 5.5 لتر من الدم، في حين أن الطفل الرضيع الذي يزن ما بين 2.3- 3.6 كيلوغرام فيصل حجم الدم في جسمه إلى 0.2 لتراً فقط!
            ',
            'دور الجهاز المناعي هو الحماية ضد المرض أو مسبباته والتي يمكن أن تكون ضارة. فعندما يعمل الجهاز المناعي بشكل صحيح، يحدد مجموعة متنوعة من التهديدات، بما في ذلك الفيروسات والبكتيريا والطفيليات، ويميزها عن الأنسجة السليمة للجسم.
            تشمل المكونات الرئيسية للجهاز المناعي ما يلي:
            
                العقد الليمفاوية: تنتج وتخزين الخلايا التي تحارب العدوى والمرض وهي جزء من الجهاز اللمفاوي أيضاً.
                الطحال: أكبر جهاز لمفاوي في الجسم، والذي هو على الجانب الأيسر، تحت أضلاعه وفوق معدتك، يحتوي على خلايا الدم البيضاء التي تحارب العدوى أو المرض. الطحال يساعد أيضا على السيطرة على كمية الدم في الجسم ويتخلص من خلايا الدم القديمة أو التالفة.
                نخاع العظم: الأنسجة الصفراء في وسط العظام تنتج خلايا الدم البيضاء. هذا النسيج الاسفنجي داخل بعض العظام، مثل عظم الفخذ والفخذ، يحتوي على خلايا غير ناضجة، تسمى الخلايا الجذعية.
                الخلايا الليمفاوية: خلايا الدم البيضاء الصغيرة تلعب دورا كبيرا في الدفاع عن الجسم ضد المرض.
                الغدة الزعترية: الغدة الزعترية كبيرة إلى حد ما عند الرضع، وتنمو حتى سن البلوغ، ثم تبدأ في الانكماش ببطء وتحل محلها الدهون مع التقدم في السن.
                الكريات البيض: هذه خلايا الدم البيضاء لمكافحة المرض تحديد والقضاء على مسببات الأمراض وهي الذراع الثاني من الجهاز المناعي الفطري. ويشار إلى ارتفاع عدد خلايا الدم البيضاء باسم زيادة عدد الكريات البيضاء.
            ',

            'هو سلسلة من الاعضاء التي تحول الطعام إلى العناصر الغذائية الأساسية التي يتم امتصاصها في الجسم ويزيل المواد غير المستخدمة.
            يبدأ الجهاز الهضمي في الفم، ويشمل المريء والمعدة والأمعاء الدقيقة والأمعاء الغليظة والمستقيم، وينتهي عند فتحة الشرج.
            تبدأ عملية الهضم مع الفم وتنتهي بعد أكل الطعام وتكسيره وهضمه في المعدة إلى فتحة الشرج للتخلص من بقايا الطعام بعد أن تقوم المعدة بامتصاص المغذيات والمعادن منه.
            تجدر الإشارة إلى أن الكبد يخلق الجليكوجين من السكريات والكربوهيدرات لإعطاء طاقة الجسم ويحول البروتينات الغذائية إلى البروتينات الجديدة التي يحتاجها نظام الدم. كما أن الكبد يكسر المواد الكيميائية غير المرغوب فيها، مثل الكحول، الذي يزيل السموم ويمر من الجسم كنفايات.',
            '

            يعمل على انتاج وتخزين والتخلص من البول، وهو الفضلات السائلة التي تفرزها الكلى، بدورها تقوم بإنتاج البول من خلال تصفية الفضلات والماء الزائد من الدم، من ثم ينتقل منها عن طريق الحالبين ليملأ المثانة، وعندما تمتلئ يقوم الإنسان بالتبول من خلال الإحليل للتخلص من الفضلات.
            يعمل الجهاز البولي مع الرئتين والجلد والأمعاء ليحافظ على اتزان المواد الكيميائية والماء في الجسم. من وظائف الجهاز البولي الأخرى: عملية التعرق التي يساعد خلالها الجسم على التخلص من الفضلات والتنفس.
            
            يتكون الجهاز البولي من الكليتين وهما عضوان على شكل حبة الفول موجودتان تحت القفص الصدري في وسط الظهر، تقوم الكليتين بتخليص الدم من اليوريا عن طريق وحدات تصفية مخصصة تدعى النفرونات، إذ تشكل اليوريا والفضلات الأخرى والماء البول الذي يمر إلى الكلية.
            من الكلية ينتقل البول عبر الحالبين إلى المثانة، ويبلغ طول كل حالب بين 20 و25 سم. تنقبض العضلات وتنبسط في الحالبين حتى تدفع البول بعيدا عن الكلى.
            المثانة عضو يشبه البالون ويتواجد في الحوض، تثبته أربطة إلى الأعضاء الأخرى وإلى عظام الحوض. تخزن المثانة البول حتى يشير الدماغ إلى الحاجة لتفريغها.
            ',
            'هو الجهاز المسؤول عن تزويد خلايا الجسم بالأكسجين وهو ضروري لأنشطة الجسم، وكذلك فإنّه يخلّصها من ثاني أكسيد الكربون. بواسطة عمليّة التّنفس يحصل الجسم على الأكسجين، حيث أنّ المهمة الأساسية لهذا الجهاز تقوم على تهيئة اللقاء بين الدّم والهواء، فيقوم الدّم بأخذ الأكسجين من الهواء ويطرد ثاني أكسيد الكربون.
            الجهاز التنفسي في الجسم قادر على سحب الهواء إلى داخل الجسم وإخراجه منه، فهو يتكوّن من أنابيب متفرّعة دقيقة، وتحتوي هذه التفريعات على حجرات صغيرة جداً يتم فيها تبادل الغازات في جدرانها، ويطلق على هذه العمليّة في الجسم عمليّة "الشهيق والزفير".',

            'هو عبارة عن شبكة من الأنسجة والأعضاء التي تساعد على تخليص الجسم من السموم والنفايات وغيرها من المواد غير المرغوب فيها. الوظيفة الأساسية للنظام اللمفاوي هو نقل الليمفاوية، وهو السائل الذي يحتوي على العدوى مكافحة خلايا الدم البيضاء، في جميع أنحاء الجسم.
            يتكون الجهاز اللمفاوي في المقام الأول من الأوعية اللمفاوية، والتي تشبه الأوردة الدموية والشعيرات الدموية. ترتبط الأوعية بالغدد الليمفاوية، حيث يتم ترشيح الليمفاوية. اللوزتين، اللحمية، الطحال والغدة الزعترية كلها جزء من الجهاز اللمفاوي.
            هناك المئات من العقد الليمفاوية في جسم الإنسان وهي تقع في مناطق مختلفة من الجسم مثل حول الرئتين والقلب.
            يعد الطحال، الذي يقع على الجانب الأيسر من الجسم فوق الكلى، أكبر جهاز لمفاوي، وهو يسيطر على كمية من خلايا الدم الحمراء وتخزين الدم في الجسم، ويساعد على مكافحة العدوى. إذا اكتشف الطحال البكتيريا الخطيرة أو الفيروسات أو غيرها من الكائنات الحية الدقيقة في الدم، فإنه - جنبا إلى جنب مع العقد الليمفاوية - يخلق خلايا الدم البيضاء تسمى الخلايا الليمفاوية، التي تعمل كمدافعين ضد الغزاة. الخلايا الليمفاوية تنتج الأجسام المضادة لقتل الكائنات الحية الدقيقة الأجنبية ووقف العدوى من الانتشار. يمكن للبشر العيش بدون طحال، على الرغم من أن الأشخاص الذين فقدوا طحالهم من المرض أو الإصابة هم أكثر عرضة للإصابة بالعدوى.',
            '

            هو عبارة عن مجموعة من الأعضاء الداخلية والخارجية التي تقوم على تحقيق عملية التكاثر لدى الإنسان، وذلك عن طريق العمل سوياً وبتكافل جميع الأعضاء في هذا الجهاز.
            يختلف هذا الجهاز تبعاً للجنس، أي ما بين ذكر وأنثى على النحو التالي:
            الجهاز التناسلي الذكري
            
            يتكون من عضوين أساسيين هما القضيب والخصيتين اللتان تعملان على انتاج الحيوانات المنوية. تقع الخصيتان في كيس الصفن الذي يضمهما خارج الجسم ويحافظ على درجة حرارتهما لتكون أقل من بقية الجسم بقليل لتسهيل عملية انتاج الحيوانات المنوية.
            أما القضيب والإحليل فيتشاركهما الجهاز البولي إلى جانب التناسلي.
            الجهاز التناسلي الأنثوي
            
            يضم في القسم الخارجي منه البظر والشفرين الصغيرين والكبيرين وغدد بارثولين أما الأعضاء الداخلية فتضم المبيضين والرحم والمهبل الذين يستقبلان الحيوانات المنوية. يرتبط المهبل بالرحم من خلال عنق الرحم بينما يرتبط مع المبيضين من خلال قناتي فالوب، ونتيجة للتغييرات الهرمونية تخرج بويضة أو أكثر من المبيضين إلى قناتي فالوب خلال فترة التبويض حيث يحدث الإخصاب.
            يحدث الإخصاب عندما تدخل الحيوانات المنوية إلى قناة فالوب لتخترق البويضة، وقد يحصل الإخصاب أيضاً في الرحم ذاته ثم تنغرس البويضة في جدار الرحم وتبدأ مرحلة تكون الجنين، وعندما يصبح ناضجاً بما يكفي ليولد، يخرج من الرحم عبر عنق الرحم الذي يتوسع وينقبض ليدفع الطفل من قناة الولادة إلى خارج الجسم.
            ',
            '

            هو مجموعة من الغدد التي تنتج الهرمونات التي تنظم عملية التمثيل الغذائي والنمو والتنمية، وظيفة الأنسجة، والوظيفة الجنسية، والنوم، والمزاج، من بين أمور أخرى.
            يتكون الجهاز الغدد الصماء من مجموعة من الغدد إلى جانب البنكرياس.
            تقوم هذه الغدد بإزالة الفضلات من الدم بهدف معالجتها ومن ثم تفرز المنتج الكيميائي النهائي للاستخدام في مكان ما في الجسم. ويؤثر نظام الغدد الصماء تقريبا على كل عضو في الجسم.
            
            على الرغم من أن الهرمونات تدور في جميع أنحاء الجسم، ويستهدف كل نوع من أنواع الهرمون نحو بعض الأعضاء والأنسجة، إلا أن نظام الغدد الصماء يحصل على بعض المساعدة من أجهزة مثل الكلى والكبد والقلب والغدد التناسلية، والتي لديها وظائف الغدد الصماء الثانوية.
            ',

            ' هو الغطاء الخارجي للجسم ويعمل على حمايته من الأضرار، والذي يشمل الجلد والشعر والحراشف والأظافر والغدد العرقية ومنتجاتها (العرق والمخاط).
            للجهاز اللحافي العديد من الوظائف، فهو يحفظ درجة حرارة الجسم و يحتوي على المستقبلات الحسية الخاصة بالألم والضغط والحرارة.
            يعد الجلد أكبر عضو في الجسم، وهو من أهم أجزاء الجهاز اللحافي.',
            '  يوفر الجهاز العضلي الهيكلي الدعم للجسم ويعطي البشر القدرة على الحركة.
            عظام الجسم (الهيكل العظمي)، والعضلات (الجهاز العضلي) والغضروف والأوتار والأربطة والمفاصل والنسيج الضام الآخر الذي يدعم ويربط الأنسجة والأعضاء معا تشمل الجهاز العضلي الهيكلي.
            الأهم من ذلك، يوفر النظام الشكل والدعم والاستقرار، والحركة إلى الجسم. على سبيل المثال، العظام تحمي الأعضاء الداخلية للجسم وتدعم وزن الجسم وهي بمثابة مستودع التخزين الرئيسي للكالسيوم والفوسفور، كما أنها تحتوي على مكونات لإنتاج خلايا الدم. عضلات الجهاز العضلي تبقي العظام في مكانها، كما أنها تلعب دورا في حركة العظام، مما يسمح للقيام بحركات متنوعة مثل الوقوف، والمشي، والجري.
             للسماح للحركة، ترتبط العظام المختلفة بواسطة المفاصل والألياف العضلية عن طريق النسيج الضام مثل الأوتار والأربطة. كما أن وجود الغضروف يمنع العظام من الاحتكاك المباشرة مع بعضها البعض.'
            
        ];

       /* $images =[
            'الجهاز العصبى',
            'الجهاز الدورى',
            'الجهاز المناعى',

            'الجهاز الهضمى',
            'الجهاز البولى',
            'الجهاز التنفسى',

            'الجهاز الليمفاوى',
            'الجهاز التناسلى',
            'الغدد الصماء',

            'الجهاز اللحافى',
            'الجهاز الهيكلى والعضلى'
            
        ];*/



        for( $i=0;$i<count($titles); $i++){
            $human_body_model =new Body();
            $human_body_model->title = $titles[$i];
            $human_body_model->description = $descriptions[$i];
            $human_body_model->save();
        }

        

    }
}






