<?php

use Illuminate\Database\Seeder;
use App\Result;
class resultSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $result =[
            'نعم, جدًا.',
            ' نعم, قليلًا.',
            ' كلا، على ما أعتقد.',

            'كلا، لن أغضب، إطلاقا. ',

            'نعم, جدًا.',
            ' نعم, قليلًا.',
            ' كلا، على ما أعتقد.',

            'كلا، لن أغضب، إطلاقا. ',

            'نعم, جدًا.',
            ' نعم, قليلًا.',
            ' كلا، على ما أعتقد.',

            'كلا، لن أغضب، إطلاقا. ',

            'نعم, جدًا.',
            ' نعم, قليلًا.',
            ' كلا، على ما أعتقد.',

            'كلا، لن أغضب، إطلاقا. ',
            'نعم, جدًا.',
            ' نعم, قليلًا.',
            ' كلا، على ما أعتقد.',

            'كلا، لن أغضب، إطلاقا. ',
          
         
        ];
        $from =[
            1,
            1,
            1,

            2,
            2,

            2,
            1,
            1,
            1,

            2,
            2,

            2,
            1,
            1,
            1,

            2,
            2,

            2,
            2,

            2,
         
        ];

        $to=[
            1,
            1,
            1,

            2,
            2,

            2,
            1,
            1,
            1,

            2,
            2,

            2,
            1,
            1,
            1,

            2,
            2,

            2,
            2,

            2,
          
        ];

        $test_id =[
            1,
            1,
            1,

            2,
            2,

            2,
          
        ];

       
        for( $i=0;$i<count($from); $i++){
            $result =new Result();
            $result ->from  = $from [$i];
            $result ->to =$to[$i];
            $result->test_id = $test_id[$i];
           
            $result->save();
        }
    }
}
