<?php

use Illuminate\Database\Seeder;
use App\Trend;
class TrendsDB extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $titles =[
            'فيروس الكورونا',

            'السرطان',

            'الاكتئاب',

            'السمنة المفرطة',

            'ضغط الدم',
        
            'السكر',
            
        ];

        $descriptions =[
            ' فيروس كورونا المستجد هو فيروس حيواني المصدر ينتقل للإنسان عند المخالطة اللصيقة لحيوانات المزرعة أو الحيوانات البرية المصابة بالفيروس. كما ينتقل عند التعامل مع فضلات هذه الحيوانات. ورغم أن المصدر الحيواني هو المصدر الرئيسي الأكثر ترجيحًا لهذه الفاشية يجب إجراء المزيد من الاستقصاءات لتحديد المصدر الدقيق للفيروس وطريقة سريان
وتنص إرشادات منظمة الصحة العالمية للبلدان والأفراد على احتمالية انتشار المرض بسبب مخالطة الحيوانات أو ملامسة الأغذية الملوثة أو انتقاله من شخص لآخر
ويتضح الآن وفقًا لأحدث المعلومات أنه يوجد على الأقل شكل من أشكال انتقال المرض بين البشر ولكن لا يتضح إلى أي مدى وتُعزز هذه المعلومات حالات العدوى بين العاملين في مجال الرعاية الصحية وبين أفراد الأسرة كما تتسق هذه المعلومات مع التجارب مع الأمراض التنفسية الأخرى لا سيّما مع الفاشيات الأخرى لفيروس كورونا
ووفقًا لما أوضحه المدير العام لمنظمة الصحة العالمية فإن : "هذه طارئة صحية في الصين ولكنها لم تصبح طارئة صحية عامة بعد ومن المحتمل أن تصبح طارئة عالمية وتقييم المنظمة للمخاطر هو أن الفاشية تُمثِّل خطرًا بالغ الشدة في الصين وخطرًا شديدًا على الصعيدين الإقليمي والعالمي"
 كما أن امكانية تطورة لا زالت مجهولة
لا زلنا في مراحل مبكرة جدًا من فهم هذا المرض ولا زال هناك الكثير لا نعرفه وتشير المعلومات الحالية إلى أن الفيروس قد يسبب أعراضًا خفيفة وتشبه الأنفلونزا كما قد يسبب مرضًا وخيمًا وبينما قد يظهر بمثابة مرض خفيف في البداية قد يتطور إلى مرض أكثر وخامة ويبدو أن الأشخاص الذين يعانون من حالات مرضية مزمنة قائمة أكثر عُرضة للإصابة بمرض أشد وخامة كما يبدو أن المسنين أكثر استعدادًا للإصابة بمرض وخيم
وسنواصل رصد المعلومات بشأن الحالات المرضية الحالية وأي حالات جديدة لأنه من المهم فهم مدى وخامة هذا المرض
 وتشمل توصيات منظمة الصحة العالمية التوصيات المعتادة للعامة التي تهدف إلى الحدّ من التعرض للأمراض ونقلها بما في ذلك النظافة الشخصية ونظافة الجهاز التنفسي والممارسات الغذائية الآمنة ما يلي:
     غسل اليدين بالصابون والماء أو فرك اليدين بمطهر كحولي؛
     تغطية الفم والأنف بقناع طبي أو منديل أو الأكمام أو ثني الكوع عند السعال أو العطس؛
     تجنب ملامسة أي شخص مصاب بأعراض زكام أو تشبه الأنفلونزا بدون وقاية والتماس الرعاية الطبية في حال الإصابة بحمى وسعال وصعوبة في التنفس؛
     عند زيارة الأسواق المفتوحة تجنب الملامسة المباشرة دون وقاية للحيوانات الحية والأسطح التي تلامسها الحيوانات؛
     طهي الطعام جيدًا وبالأخص اللحوم
   و لا توجد أي علاجات محددة لهذا النوع من فيروس كورونا المستجد ويعتمد العلاج على الأعراض السريرية وتوجد علاجات قيد الاستقصاء من خلال تجارب عن طريق الملاحظة وتجارب سريرية يخضع لها المرضى المصابون بفيروس كورونا المسبب لمتلازمة الشرق الأوسط التنفسية

             ',
             'يشير السرطان إلى أي مرض ضمن عدد كبير من الأمراض التي تتميز بتطور خلايا شاذة تنقسم بطريقة لا يمكن السيطرة عليها ولديها القدرة على التسلل وتدمير أنسجة الجسم الطبيعية السرطان في كثير من الأحيان لديه القدرة على الانتشار في جميع أنحاء الجسم
السرطان هو السبب الرئيسي الثاني للوفاة في العالم لكن معدلات البقاء على قيد الحياة تتحسن بالنسبة لأنواع كثيرة من السرطان، وذلك بفضل التحسينات في طرق فحص السرطان وعلاجه
والعوامل المسببة له متعددة فقد ينشأ السرطان عن تحوّل الخلايا العادية إلى أخرى ورمية في عملية متعدّدة المراحل تتطور عموماً من آفة محتملة التسرطن إلى أورام خبيثة وهذه التغيّرات ناجمة عن التفاعل بين عوامل الفرد الجينية وثلاث فئات من العوامل الخارجية، ومنها  :
    العوامل المادية المسرطنة، مثل الأشعة فوق البنفسجية والأشعة المؤيّنة؛
    والعوامل الكيميائية المسرطنة، مثل الأسبستوس ومكوّنات دخان التبغ والأفلاتوكسين (أحد الملوّثات الغذائية) والزرنيخ (أحد ملوّثات مياه الشرب)؛
    والعوامل البيولوجية المسرطنة، مثل أنواع العدوى الناجمة عن بعض الفيروسات أو البكتيريا أو الطفيليات
وتحتفظ منظمة الصحة العالمية بتصنيف للعوامل المسرطنة من خلال وكالتها المعنية ببحوث السرطان، أي الوكالة الدولية لبحوث السرطان
ويُعدّ التشيّخ من العوامل الأساسية الأخرى للإصابة بالسرطان الذي ترتفع معدلاته بشكل كبير مع التقدّم في السن، ومن المُرجّح أن يُردّ ذلك إلى زيادة مخاطر الإصابة بأنواع معيّنة من السرطان مع التشيّخ ويقترن تراكم مخاطر الإصابة بالسرطان بميل فعالية آليات إصلاح الخلايا إلى الاضمحلال كلّما تقدم الشخص في السن
             '
             ,
             
            ' أعراض الاكتئاب تعد من الموضوعات التي شغلت مجال الطب النفسي في الوقت الأخير، حيث انه من المعروف أن الأمراض النفسية تكون أكثر ضررا من الأمراض العضوية، وذلك لان المرض العضوي يمكن تحديد مكان الألم والسبب الرئيسي لمركز العالم ولكن مثل هذه الأمور لا تحدث مع المرض النفسى وخاصة الاكتئابوخصوصا أن تعريف الاكتئاب يصعب تحديده على وجه الدقة، وهو من المشاكل التي تواجه المتخصصين في هذه الأمراض
            مع العلم  أن الاكتئاب  صعب ملاحظته الى حد ما، وخصوصا في المراحل الأولي من بداية المرض، ولكن بالتأكيد هناك مجموعة من العوامل أو الأعراض التي تظهر على المريض، ولكن الحالات تختلف من مريض لأخر والاسباب ايضا تختلف من شخص لأخر ربما يكون أحدهم قد تعرض لبعض الصدمات الحياتية، مثل وفاة أحد المقربين إليه، أو خسارة مبلغ مالي، أو فشل في مشروع وغيرها من الأسباب التي قد تؤدي إلى الإكتئاب
            ومن الطبيعي ان يستمر الامر لفترة مؤقتة، ولكن مرض الاكتئاب هو استمرار هذا الشخص في الحزن لفترة طويلةوبالتالي لا يستطيع الفرد التكيف مع الحياة، كما أن هناك فرق واضح بين الحزن والاكتئاب وهو أن الحزن سببه معروف بينما نجد أن الاكتئاب سببه غير معروف، وإنما الشخص المكتئب يعيش في حزنه لفترة طويلة ، ومن أسوء الأمور التي تواجه الشخص المكتئب انه غير قادر على إخبار الاخرين  من أين يأتي الألم، وهذه مسألة صعبة بالتأكيد وفى غاية القسوة
            ونود أن نؤكد قبل البدء في سرد أعراض الاكتئاب وكيفية علاجه،  أن مرض الاكتئاب مثله مثل أي مرض يمكن أن يتم الشفاء، حيث يمكن من خلال التشخيص والعلاج المناسبين أن يتم الشفاء في أوقات قليلة قد تصل إلي عدة أسابيع، وبالتالي يرجع الشخص كما كان على طبيعته تماما ويتمكن من ممارسة من حياته التقليدية
            ولكن اذا اردنا ان نكتب تعريفا للاكتئاب فبالتأكيد أن إيجاد تعريف عملي وواضح للاكتئاب يعد من الأمور الصعبة في مجال الطب النفسي ولكن الشيء المؤكد في هذا المرض إنه مرض مثل أي مرض آخر يمكن علاجه كما أن أعراضه تؤثر على حالتك الجسدية والانفعالية والعقلية
            ولكن على  حسب تعريف المكتبة القومية الأميركية للطب NHL( معاهد الصحة القومية) فإن الاكتئاب هو مرض نفسي طبي يمكن علاجه 
            لا شك أن أعراض الاكتئاب عديدة ومتنوعة وربما تشعر في بعض الأوقات أن لديك هذا المرضولكننا نود أن نطمئن عزيزي القارئ أنك لكى تحكم على نفسك انك مريض بالاكتئاب لابد أن تتوجه لزيارة طبيب نفسي اولاً وفى نفس الوقت  لابد أن تستمر معك الاعراض لمدة أسبوعين على الأقل ويصيبه القلق النفسي
            وللتوضيح فإن النساء دائما  ما يتعرضن لأعراض الاكتئاب أكثر من الرجال وربما يرجع السبب في ذلك إلى أن السيدات يتعرضن الى  كمية  ضغوط في حياتهن العملية واليومية  أكثر من الرجال سواء كانت هذه الضغوط اجتماعية أو بيولوجية ونود أن  نوضح أن أعراض الاكتئاب يمكن أن تصيب الفرد في أي مرحلة سنية وتكون نسبة إصابة الأشخاص بالاكتئاب أكثر في الفترة ما بين 24 إلى 44 عام        '
            ,

            'السِمْنَة مرض معقد يتضمن وجود زيادة مفرطة في كمية الدهون بالجسم السمنة ليست مجرد مصدر قلق بشأن المظهر الجمالي فهي مشكلة طبية تزيد من عوامل خطر الإصابة بأمراض ومشكلات صحية أخرى مثل مرض القلب وداء السكري وارتفاع ضغط الدم وأنواع معينة من السرطان
وهناك العديد من الأسباب خلف مواجهة بعض الأشخاص لصعوبات في تجنُّب السِمْنَة تنشأ السِمْنَة عادةً من خلال الجمع بين عدد من العوامل الوراثية مع خيارات البيئة المحيطة والنظام الغذائي الشخصي والتمارين الرياضية
ولكن الأمر الجيد هو أن حتى الفقدان البسيط في الوزن بإمكانه أن يُحسِّن أو يقي من المشكلات الصحية المرتبطة بالسِمْنَة يُمكن أن يساعدك كل من تغيير النظام الغذائي وزيادة النشاط البدني والتعديلات السلوكية على فقدان الوزن الزائد كما يمكن اللجوء للأدوية المقررة بوصفة طبية وإجراءات إنقاص الوزن كخيارات إضافية لعلاج السِمْنَة
تُشخَّص الإصابة بالسمنة عندما يساوي مؤشر كتلة الجسم 30 أو أكثر لحساب مؤشر كتلة الجسم فاقسم وزنك بالأرطال على طولك بالبوصة المربعة ثم اضرب الناتج في 703 أو اقسم وزنك بالكيلوغرام على طولك بالمتر المربع * طولك مرة أخرى
فاذا كان أقل من 185 فأنت نحيف وإذا كان من 185 ل 25 فأنت طبيعي ومن 25 ل 30 فهذه سمنه واكثر من ذلك سمنة مفرطة
بالنسبة إلى معظم الناس يوفر  تقييمًا دقيقًا نسبيًّا للدهون في الجسم على الرغم من ذلك لا يقيس  دهون الجسم بصورة مباشرة؛ لذا بالنسبة لبعض الناس كالرياضيين مفتولي العضلات قد يصنف  مع أنه ليس لديهم دهون زائدة
و إذا كنتَ قلقًا بشأن المشكلات الصحية المرتبطة بالوزن فاسألْ طبيبكَ عن علاج السِمْنَة يُمكنكَ أنتَ وطبيبكَ تقييم المخاطر الصحية ومناقشة خيارات إنقاص الوزن المتاحة لك
            '
            ,
'يُعبّر ضغط الدم (بالإنجليزية: Blood Pressure) عن القوة التي يؤثر فيها الدم على جدران الأوعية الدموية عندما يقوم القلب بضخه وتعتمد قراءات ضغط الدم على عاملين اثنين هما القوة التي يضخ فيها القلب الدم ومقاومة الأوعية الدموية للدم عند تدفقه فيها ومن الجدير بالذكر أنّ نسب المعاناة من ارتفاع ضغط الدم قد ارتفعت بشكلٍ جليّ في العقود الأخيرة فبالاستناد إلى الإحصائيات المُجراة مؤخراً تبيّن أنّ هناك ما يُقارب 85 مليون شخص يُعانون من ضغط الدم المرتفع في الولايات المتحدة الأمريكية
 وقد عزت منظمة الصحة العالمية (بالإنجليزية: World Health Organization) ذلك إلى زيادة معدل تصنيع الغذاء وكثرة الأطعمة الجاهزة والمُحضّرة التي يُضاف إليها الملح وتجدر الإشارة إلى أنّ ضغط الدم يُعدّ طبيعياً في حال كان يُعادل 120/80 ملم زئبق وإنّ ارتفاعه ليصل إلى 130/80 يُعدّ خطراً مؤذناً
  لتشخيص الإصابة بمرض ضغط الدم المرتفع (بالإنجليزية: High Blood Pressure) وإنّ ترك هذا المرض دون علاج يُسفر عن معاناة المصاب من العديد من المضاعفات الصحية بما فيها النوبات القلبية (بالإنجليزية: Heart Attacks) والسكتات الدماغية (بالإنجليزية: Stroke) وفشل القلب (بالإنجليزية: Heart Failure) وفشل الكلى (بالإنجليزية: Kidney Failure) واعتلال الشبكية المصاحب لارتفاع ضغط الدم (بالإنجليزية: Hypertensive retinopathy) الذي قد يُسبّب العمى وغير ذلك
و في الحقيقة لا يمكن الكشف عن الإصابة بضغط الدم المرتفع إلا عن طريق فحص ضغط الدم وذلك لأنّ هذا المرض في العادة لا يُرافقه ظهور أية أعراض أو علامات وهذا ما يُفسّر عدم إدراك الكثير من المصابين معاناتهم من المرض ولهذا يُنصح بإجراء فحص دوريّ لضغط الدم وخاصة في حال كان أحد الأقارب من الدرجة الأولى مصاباً بمرض ضغط الدم المرتفع وهذا لا يمنع أنّ هناك بعض الحالات التي تظهر فيها على المصابين بعض الأعراض والعلامات وخاصة في حال ارتفاع ضغط الدم ارتفاعاً شديداً

'
  ,
  'الأنسولين هو هرمون ينظّم مستوى السكر في الدم ويُعد فرط سكر الدم أو ارتفاع مستوى السكر في الدم من الآثار الشائعة التي تحدث جرّاء عدم السيطرة على داء السكري ويؤدي مع الوقت إلى حدوث أضرار وخيمة في العديد من أجهزة الجسم ولاسيما الأعصاب والأوعية 
  الدموية
  وفي عام 2014 كان 8.5% من البالغين الذين تبلغ أعمارهم 18 عاماً أو أكثر مصابين بداء السكري وفي عام 2012 كان داء السكري سبباً مباشراً في 1.5 مليون حالة وفاة وكان ارتفاع كلوكوز الدم قد سبب بوفاة 2.2 مليون شخص اخرين
  و لداء السكري أنماط أو أنواع عديدة 
  فيتسم داء السكري من النمط 1 (الذي كان يُعرف سابقاً باسم داء السكري المعتمد على الإنسولين أو داء السكري الذي يبدأ في مرحلة الشباب أو الطفولة) بنقص إنتاج الإنسولين ويقتضي تعاطي الإنسولين يوميا ولا يُعرف سبب داء السكري من النمط 1 ولا يمكن الوقاية منه باستخدام المعارف الحالية
  وتشمل أعراض هذا الداء فرط التبوّل والعطش والجوع المستمر وفقدان الوزن والتغيرات في البصر والإحساس بالتعب وقد تظهر هذه الأعراض فجأة
  أما بالنسبة لداء السكري نمط 2 يحدث هذا النمط (الذي كان يُسمى سابقاً داء السكري غير المعتمد على الإنسولين أو داء السكري الذي يظهر في مرحلة الكهولة) بسبب عدم فعالية استخدام الجسم للإنسولين وتحدث في معظمها نتيجة لفرط الوزن والخمول البدني
  وقد تكون أعراض هذا النمط مماثلة لأعراض النمط 1 ولكنها قد تكون أقل وضوحاً في كثير من الأحيان و لذا فقد يُشخّص الداء بعد مرور عدة أعوام على بدء الأعراض أي بعد حدوث المضاعفات
  وهذا النمط من داء السكري لم يكن يُصادف إلا في البالغين حتى وقت قريب ولكنه يحدث الآن في صفوف الأطفال أيضاً
  ومن أنواعة المؤقتة داء السكر الحملي و هو فرط سكر الدم الذي تزيد فيه قيم كلوكوز الدم على المستوى الطبيعي دون أن تصل إلى المستوى اللازم لتشخيص داء السكري ويحدث ذلك أثناء الحمل4 والنساء المصابات بالسكر الحملي أكثر تعرضاً لاحتمالات حدوث مضاعفات الحمل والولادة كما أنهن وأطفالهن أكثر تعرضاً لاحتمالات الإصابة بداء السكري من النمط 2 في المستقبل
  ويُشخّص داء السكري الحملي عن طريق التحري السابق للولادة لا عن طريق الأعراض المبلغ عنها
  وهناك اجراءات وقائية ثبتت فعاليتها متعلقة بنمط المعيشة في الوقاية من داء السكري من النمط 2 أو تأخير ظهوره وللمساعدة على الوقاية من داء السكري من النمط 2 ومضاعفاته ينبغي للأشخاص ما يلي:
  العمل على بلوغ الوزن الصحي والحفاظ عليه؛
  ممارسة النشاط البدني أي ما لا يقلّ عن 30 دقيقة من النشاط البدني المعتدل والمنتظم في معظم أيام الأسبوع ويتطلب ضبط الوزن المزيد من النشاط البدني؛
  اتباع نظام غذائي صحي يشمل ثلاث إلى خمس حصص يومية من الفواكه والخضر والحد من مدخول السكر والدهون المشبّعة؛
  تجنّب تعاطي التبغ حيث إن التدخين يزيد من مخاطر الإصابة بالأمراض القلبية الوعائية
  و يمكن تشخيص هذا الداء في مراحل مبكّرة بواسطة فحوص الدم الزهيدة التكلفة نسبياً
  ويتمثل علاج داء السكري في تحسين النظام الغذائي والنشاط البدني وخفض مستوى الكلوكوز في الدم ومستويات سائر عوامل الخطر المعروفة الي تضر بالأوعية الدموية كما يُعد الإقلاع عن التدخين مهماً أيضاً لتجنّب المضاعفات
  '
            
        ];

       $image =[
            '../trends/corona.jpg',
            '../trends/cancer.jpg',
            '../trends/dep.jpg',

            '../trends/fat.jpg',
            '../trends/blood.jpg',
            '../trends/dia.jpg'
            
        ];



        for( $i=0;$i<count($titles); $i++){
            $trend =new Trend();
            $trend->title = $titles[$i];
            $trend->description = $descriptions[$i];
            $trend->avatar = $image[$i];
            $trend->save();
        }

        

    }
}


